package com.labor.word;


import java.text.ParseException;
import java.text.SimpleDateFormat;
import java.util.ArrayList;
import java.util.Calendar;
import java.util.Iterator;
import java.util.List;

import com.labor.util.Db_Util;
import com.labor.util.WordUtil;
import com.lowagie.text.DocumentException;

public class dadan {
	public static void main(String[] args) throws ParseException, DocumentException  {
		
		Calendar bron = Calendar.getInstance();
		Calendar join = Calendar.getInstance();
		Calendar shen = Calendar.getInstance();

		SimpleDateFormat df = new SimpleDateFormat("yyyy-MM");
		SimpleDateFormat df1 = new SimpleDateFormat("yyyy-MM-dd");
		
		List<Person> list = new ArrayList<Person>();
		
		String remark = "";
		
		
		Company comp = new Company();
		
		
		
		
		
		comp.setComp("大运公司");//公司
		
		comp.setKesh(1);//科室 1-业务一科，2-业务二科，3-业务三科，4-直属
		
		comp.setSex(2);//性别 1-男，2-女
		
		comp.setType(1);//身份 1-工人，2-干部
		
		comp.setShenfen(1);//类型 1-正常，2-病退，3-特殊工种，4-退职， 5-破产
		
		shen.setTime(df1.parse("2010-01-30"));//受理时间
		
		comp.setShen(shen);
		
		comp.setExtra2("    申请已写");



		
		
		
		
//有单
		
		
		
		
//已打

		

		
		
	
		
		
		
		
		remark = "3";
//		remark = "2";
//		remark = "1";
//		remark = "4";
//		,"2013-"
//		,"2013-12-30"
//		,"2013-01-30"
//		,"2013-04-30"
//		全	444
		
//		
//		list.add(new Person("                ",3,1,"1953-","197",1,1,1,"大大大","原"));
//		
//		list.add(new Person("                ",3,2,"1963-","198",1,1,1,"大大大","原"));
//		
//		
//		list.add(new Person("                ",3,1,"195","197",1,3,1,"大大大","原","2013-11-30"));
//		list.add(new Person("                ",3,2,"196","198",1,3,1,"大大大","原","2013-11-30"));
		
		

		
/////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
		
		
		
		
		list.add(new Person("150121195203021059","19","19",1,1,1,"郝永生","土默特左旗电力有限责任公司",1,1));

		list.add(new Person("150121196305284620","19","19",1,1,1,"李月鲜","土默特左旗电力有限责任公司",1,2));

		list.add(new Person("150103196312300569","19","19",1,1,1,"罗玲","内蒙古捷欣置业有限责任公司",1,2));

		list.add(new Person("150103196403242026","19","19",1,1,1,"王淑霞","城发公司",1,2));

		list.add(new Person("150102195404160056","19","19",1,1,1,"徐英武","呼和浩特市西河管理处",2,1));

		list.add(new Person("152601196404210524","19","19",1,1,1,"戴青","内蒙古铁骑集团",1,2));

		list.add(new Person("150102195808084522","19","19",1,1,1,"虞凤娟","呼市建筑工程有限责任公司",1,2));

		list.add(new Person("152323196810064624","19","19",1,1,1,"包牡丹","内蒙古巴彦塔拉饭店有限责任公司",4,2));

		list.add(new Person("152301195401040573","19","19",1,1,1,"宋希彬","内蒙古派利建筑工程公司",4,1));

		list.add(new Person("150104195402250536","19","19",1,1,1,"周绥生","内蒙古伊利实业集团股份有限公司",1,1));

		list.add(new Person("150102196403230029","19","19",1,1,1,"贾巧莲","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150102196311294527","19","19",1,1,1,"滑敏","呼市酒盈商贸有限责任公司",1,2));

		list.add(new Person("152826195705030416","19","19",1,1,1,"李守清","内蒙古黄金机械修造厂",1,1));

		list.add(new Person("150121196405308220","19","19",1,1,1,"张秀清","呼市满都海公园管理处",2,2));

		list.add(new Person("150102195205262017","19","19",1,1,1,"李济泉","内蒙古北方园林绿化工程有限责任公司",1,1));

		list.add(new Person("150103196906271523","19","19",1,1,1,"矫丽娟","内蒙古宏立达橡塑机械有限责任公司",1,2));

		list.add(new Person("150102196309124529","19","19",1,1,1,"李丽萍","内蒙古自治区党委机关幼儿园",2,2));

		list.add(new Person("15010219540510307X","19","19",1,1,1,"柯善理","呼和浩特市军队转业干部服务中心",1,1));

		list.add(new Person("150102196707010586","19","19",1,1,1,"佟银花","内蒙古大学艺术学院",1,2));

		list.add(new Person("150103195907082623","19","19",1,1,1,"乌日娜","内蒙古电影发行放映有限责任公司",4,2));

		list.add(new Person("150102196402080049","19","19",1,1,1,"马志荣","内蒙古文化大厦",2,2));

		list.add(new Person("211224196404200922","19","19",1,1,1,"杨秀春","内蒙古文化大厦",2,2));

		list.add(new Person("150102196311190728","19","19",1,1,1,"删除","内蒙古民族商场有限责任公司",1,2));

		list.add(new Person("150105196402109023","19","19",1,1,1,"郝丽肖","纳爱斯集团有限公司内蒙古分公司",2,2));

		list.add(new Person("152623195809200029","19","19",1,1,1,"王雪清","呼和浩特市区回民区地方税务局",2,2));

		list.add(new Person("150104196404080045","19","19",1,1,1,"吉雪荣","中国石油内蒙古呼和浩特销售分公司",2,2));

		list.add(new Person("150105196407199048","19","19",1,1,1,"云素芳","内蒙古伊利实业集团股份有限公司",1,2));

		list.add(new Person("150102195403212010","19","19",1,1,1,"刘小勇","内蒙古自治区人力资源公共服务中心",4,1));

		list.add(new Person("150102195408181532","19","19",1,1,1,"杨俊杰","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150102195902092017","19","19",1,1,1,"马智","日信海清物业服务有限责任公司",1,1));

		list.add(new Person("150422196408143348","19","19",1,1,1,"杨秀云","内蒙古蒙达办公自动化服务中心",4,2));

		list.add(new Person("150105196905290020","19","19",1,1,1,"陈颖","内蒙古金岗重工有限公司",4,2));

		list.add(new Person("150102196408150140","19","19",1,1,1,"包菊花","呼和浩特市城发投资经营有限责任公司",1,2));

		list.add(new Person("150102196403040129","19","19",1,1,1,"涛娅","内蒙古日报社",2,2));

		list.add(new Person("150102196208241523","19","19",1,1,1,"张丽萍","土默特左旗电力有限责任公司",1,2));

		list.add(new Person("150102196404100146","19","19",1,1,1,"韩继红","内蒙古北京吉普汽车特约经销",1,2));

		list.add(new Person("150221195409180333","19","19",1,1,1,"吕宏罗","中海石油天野化工有限责任公司",4,1));

		list.add(new Person("150104195409040515","19","19",1,1,1,"郑俊俊","呼市大元农机销售有限公司",1,1));

		list.add(new Person("152801196407030343","19","19",1,1,1,"李昂","内蒙古呼和浩特际华五三零三服装有限公司",1,2));

		list.add(new Person("150102195409292031","19","19",1,1,1,"董二明","内蒙古金川投资担保有限责任公司",2,1));

		list.add(new Person("150102195905264048","19","19",1,1,1,"李文慧","回民区城市管理行政执法局",2,2));

		list.add(new Person("152824196410200627","19","19",1,1,1,"韩玉凤","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("150102196410314044","19","19",1,1,1,"王桂风","内蒙古元博工程设计咨询有限公司",4,2));

		list.add(new Person("150204196410220062","19","19",1,1,1,"刘芬","内蒙古原林羊绒制品有限公司",2,2));

		list.add(new Person("152101196110291544","19","19",1,1,1,"于海澜","内蒙古高路公司呼和浩特分公司",2,2));

		list.add(new Person("150121196406158340","19","19",1,1,1,"云莉","土默特左旗电力有限责任公司",1,2));

		list.add(new Person("150121196410201946","19","19",1,1,1,"刘新风","土默特左旗电力有限责任公司",1,2));

		list.add(new Person("150121196401308223","19","19",1,1,1,"王介飞","土默特左旗电力有限责任公司",1,2));

		list.add(new Person("150105195410155017","19","19",1,1,1,"王宏业","新城区古路板林场",2,1));

		list.add(new Person("15012119641017102X","19","19",1,1,1,"李海娥","内蒙古伊利实业集团股份有限公司液态奶事业部",1,2));

		list.add(new Person("120102196407070725","19","19",1,1,1,"吕晓红","内蒙古自治区纤维检验局",4,2));

		list.add(new Person("150102196811091566","19","19",1,1,1,"张丽","呼和浩特市金苹果彩色印刷有限公司",2,2));

		list.add(new Person("150105196306189043","19","19",1,1,1,"赵秀兰","呼市自来水公司",1,2));

		list.add(new Person("150102196810253041","19","19",1,1,1,"王莉英","呼和浩特日报社印刷厂",2,2));

		list.add(new Person("150104195811130535","19","19",1,1,1,"夏志坚","内蒙古昆明卷烟有限责任公司",1,1));

		list.add(new Person("150122196411280523","19","19",1,1,1,"云秀琴","托克托电力有限责任公司",1,2));

		list.add(new Person("150104196411100542","19","19",1,1,1,"王秀云","内蒙古自治区人力资源公共服务中心",4,2));

		list.add(new Person("150105196410267320","19","19",1,1,1,"闫桃芳","内蒙古医院劳动服务公司",2,2));

		list.add(new Person("150105196108209015","19","19",1,1,1,"李全文","呼和浩特市第二中学校办工厂",2,1));

		list.add(new Person("150103196304030060","19","19",1,1,1,"刘俊平","内蒙古日报印务中心",2,2));

		list.add(new Person("150103196507130010","19","19",1,1,1,"邵小龙","内蒙古自治区人力资源公共服务中心",4,1));

		list.add(new Person("15010219620623002X","19","19",1,1,1,"鲍晓芳","内蒙古自治区人力资源公共服务中心",4,2));

		list.add(new Person("150104196010271519","19","19",1,1,1,"郝保明","呼市市政公司",1,1));

		list.add(new Person("150102196804250020","19","19",1,1,1,"余丽云","内蒙古维多利超市连锁有限责任公司",2,2));

		list.add(new Person("15010519591005102X","19","19",1,1,1,"董素珍","内蒙古金安达人力资源服务有限责任公司",2,2));

		list.add(new Person("15010419640120054X","19","19",1,1,1,"邹雪梅","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150103196812081147","19","19",1,1,1,"齐玉梅","呼和浩特市青城公园管理处",2,2));

		list.add(new Person("370321195412090618","19","19",1,1,1,"田承财","内蒙古吉祥房地产开发有限公司",2,1));

		list.add(new Person("150102196412152544","19","19",1,1,1,"皇莹","金宇保灵生物药品有限公司",4,2));

		list.add(new Person("150104196412160045","19","19",1,1,1,"刘凤英","金宇保灵生物药品有限公司",4,2));

		list.add(new Person("150402196403170325","19","19",1,1,1,"花丰慧","内蒙古国际旅行卫生保健中心",2,2));

		list.add(new Person("150102196412212543","19","19",1,1,1,"石文君","内蒙古人民广播电台",2,2));

		list.add(new Person("150102195512152053","19","19",1,1,1,"李培敬","内三建",1,1));

		list.add(new Person("150102195010251510","19","19",1,1,1,"孟广文","内蒙古高等级公路建设开发有限责任公司呼和浩特分公司",2,1));

		list.add(new Person("150103196410150525","19","19",1,1,1,"王小菊","内蒙古自治区机械设备成套有限责任公司",4,2));

		list.add(new Person("150103195309201012","19","19",1,1,1,"王和平","欧美投资集团（内蒙古）生物科技有限公司",2,1));

		list.add(new Person("15262619600827542X","19","19",1,1,1,"张拴利","内蒙古众信人力资源服务有限责任公司",2,2));

		list.add(new Person("130702196410050324","19","19",1,1,1,"智鲜平","际华五三零三服装有限公司",4,2));

		list.add(new Person("152628196412250024","19","19",1,1,1,"孙改香","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("15010319540302151X","19","19",1,1,1,"赵永刚","呼市城发投资经营有限责任公司",1,1));

		list.add(new Person("150102195410022557","19","19",1,1,1,"李占虎","内蒙古高等级公路建设开发有限责任公司",2,1));

		list.add(new Person("150102195908011011","19","19",1,1,1,"韩开光","内蒙古变压器厂",1,1));

		list.add(new Person("150105195404040539","19","19",1,1,1,"禹培珍","呼和浩特市瑞环集团有限公司",2,1));


		list.add(new Person("152502195412020516","19","19",1,1,1,"那顺吉日嘎拉","内蒙古自治区公路局",4,1));

		list.add(new Person("152824196501120649","19","19",1,1,1,"刘云","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("14273119601217452X","19","19",1,1,1,"庞淑华","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("610113196502191643","19","19",1,1,1,"王淑茹","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("152824196501240624","19","19",1,1,1,"尹方艳","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("152621196105180041","19","19",1,1,1,"王素芳","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("512501195404022731","19","19",1,1,1,"苗锋","中海石油天野化工有限责任公司",4,1));

		list.add(new Person("150105195503202054","19","19",1,1,1,"席全锁","中海石油天野化工有限责任公司",4,1));

		list.add(new Person("152601196502101049","19","19",1,1,1,"石秀兰","内蒙古银行股份有限公司呼和浩特分行",1,2));

		list.add(new Person("150105195501040012","19","19",1,1,1,"吕玉成","内蒙古航天红岗机械有限公司",4,1));

		list.add(new Person("150105195501030017","19","19",1,1,1,"李铁","内蒙古航天红岗机械有限公司",4,1));

		list.add(new Person("150102196002064541","19","19",1,1,1,"陈月华","内蒙古航天红岗机械有限公司",4,2));

		list.add(new Person("150105196502040027","19","19",1,1,1,"范英弟","内蒙古航天红岗机械有限公司",4,2));

		list.add(new Person("150105196501020024","19","19",1,1,1,"原丽华","内蒙古航天红岗机械有限公司",4,2));

		list.add(new Person("150105195401020014","19","19",1,1,1,"任振华","内蒙古航天红岗机械有限公司",4,1));

		list.add(new Person("150103195503192519","19","19",1,1,1,"马宽","内蒙古通达实业股份有限公司",2,1));

		list.add(new Person("15010419550313151X","19","19",1,1,1,"曹柏寿","内蒙古通达实业股份有限公司",2,1));

		list.add(new Person("150103196503312028","19","19",1,1,1,"刘艳玲","内蒙古通达实业股份有限公司",2,2));

		list.add(new Person("150104196503251524","19","19",1,1,1,"甄凤玲","内蒙古通达实业股份有限公司",2,2));

		list.add(new Person("15010219550203001X","19","19",1,1,1,"杨平胜","内蒙古通达实业股份有限公司",2,1));

		list.add(new Person("150102195502020532","19","19",1,1,1,"赵新中","内蒙古通达实业股份有限公司",2,1));

		list.add(new Person("150103195502272517","19","19",1,1,1,"马春林","内蒙古通达实业股份有限公司",2,1));

		list.add(new Person("150102196503134069","19","19",1,1,1,"方顺林","内蒙古通达实业股份有限公司",2,2));

		list.add(new Person("150102196502221523","19","19",1,1,1,"李美萍","九牧王股份有限公司呼和浩特分公司",2,2));

		list.add(new Person("150102196501210021","19","19",1,1,1,"刘萍","远方出版社（有限责任公司）",4,2));

		list.add(new Person("150105196007035028","19","19",1,1,1,"陈淑瑞","呼和浩特市胜利纸品有限责任公司",2,2));

		list.add(new Person("152630195502120810","19","19",1,1,1,"张世德","呼和浩特市胜利纸品有限责任公司",2,1));

		list.add(new Person("150104195502262016","19","19",1,1,1,"高爱平","呼和浩特市光源电力安装有限责任公司",4,1));

		list.add(new Person("15010319660104002X","19","19",1,1,1,"李风","呼和浩特市光源电力安装有限责任公司",4,2));

		list.add(new Person("150102196501294026","19","19",1,1,1,"刘新梅","呼和浩特市光源电力安装有限责任公司",4,2));

		list.add(new Person("150102196503013064","19","19",1,1,1,"张守荣","内蒙古农牧业生产资料股份有限公司",4,2));

		list.add(new Person("150104196503190522","19","19",1,1,1,"乌兰","内蒙古饭店有限责任公司",1,2));

		list.add(new Person("150102195501252016","19","19",1,1,1,"王建国","内蒙古农业大学劳动服务中心",4,1));

		list.add(new Person("150104196503200567","19","19",1,1,1,"曹杏媛","内蒙古农业大学劳动服务中心",4,2));

		list.add(new Person("152633196303293421","19","19",1,1,1,"孔祥慧","内蒙古农业大学劳动服务中心",4,2));

		list.add(new Person("15010419650313052X","19","19",1,1,1,"寇月英","内蒙古农业大学劳动服务中心",4,2));

		list.add(new Person("150103195502281018","19","19",1,1,1,"董棉才","呼和浩特春华威嘉水务运营有限责任公司",2,1));

		list.add(new Person("150103196501031062","19","19",1,1,1,"云培珍","呼和浩特春华威嘉水务运营有限责任公司",2,2));

		list.add(new Person("150102195502191518","19","19",1,1,1,"张双喜","呼和浩特春华威嘉水务运营有限责任公司",2,1));

		list.add(new Person("150105196502091545","19","19",1,1,1,"安珍","呼和浩特春华威嘉水务运营有限责任公司",2,2));

		list.add(new Person("150102195502104592","19","19",1,1,1,"刘云学","燕京啤酒呼和浩特有限公司",1,1));

		list.add(new Person("150102195503144035","19","19",1,1,1,"路建明","呼市保安服务公司",1,1));

		list.add(new Person("150102196501214583","19","19",1,1,1,"王彩凤","内蒙古农业厅招待所",4,2));

		list.add(new Person("150104195502152538","19","19",1,1,1,"王亮","呼市粮油食品总公司",1,1));

		list.add(new Person("150104196501170026","19","19",1,1,1,"王芝玲","呼市第一面粉厂",1,2));

		list.add(new Person("152101195501230015","19","19",1,1,1,"柴玉柱","中国农业机械化科学研究院呼和浩特分院",4,1));

		list.add(new Person("150104195502230516","19","19",1,1,1,"王明宿","中国农业机械化科学研究院呼和浩特分院",4,1));

		list.add(new Person("150102195503172036","19","19",1,1,1,"张胜军","中国农业机械化科学研究院呼和浩特分院",4,1));

		list.add(new Person("150104195502110055","19","19",1,1,1,"赵玉才","内蒙古邮电建筑安装有限责任公司",2,1));

		list.add(new Person("150105195503212519","19","19",1,1,1,"李兰召","内蒙古邮电建筑安装有限责任公司",2,1));

		list.add(new Person("150102196001080064","19","19",1,1,1,"杨荣彦","内蒙古建筑勘察设计研究院有限责任公司",4,2));

		list.add(new Person("150102195502113018","19","19",1,1,1,"银常在","内蒙古建筑勘察设计研究院有限责任公司",4,1));

		list.add(new Person("150102195503050012","19","19",1,1,1,"马洪斌","内蒙古建筑勘察设计研究院有限责任公司",4,1));

		list.add(new Person("150103196503091042","19","19",1,1,1,"杨晓白","宁波方太营销有限公司呼和浩特市服务中心",2,2));

		list.add(new Person("150102196003111530","19","19",1,1,1,"钟跃华","内蒙古航天红岗机械有限公司",4,1));

		list.add(new Person("150104196503020021","19","19",1,1,1,"杨俊英","呼市恒昌商贸有限责任公司",1,2));

		list.add(new Person("150102196005232061","19","19",1,1,1,"乌仁陶格斯","内蒙古电影集团有限责任公司",4,2));

		list.add(new Person("150102195502204518","19","19",1,1,1,"苏道毕力格","内蒙古电影集团有限责任公司",4,1));

		list.add(new Person("150103195512031514","19","19",1,1,1,"王绍海","内蒙古电影集团有限责任公司",4,1));

		list.add(new Person("150102196503290029","19","19",1,1,1,"刘桂兰","宁波方太营销有限公司呼和浩特市服务中心",2,2));

		list.add(new Person("150102196503084540","19","19",1,1,1,"段宝萍","呼市通力达储运贸易有限责任公司",1,2));

		list.add(new Person("150104195502010011","19","19",1,1,1,"乔宪","呼市通力达储运贸易有限责任公司",1,1));

		list.add(new Person("150102195503034514","19","19",1,1,1,"田继生","呼市通力达储运贸易有限责任公司",1,1));

		list.add(new Person("15010319550307001X","19","19",1,1,1,"王安琪","内蒙古电影发行放映有限责任公司",4,1));

		list.add(new Person("150103196503152044","19","19",1,1,1,"韩玉梅","内蒙古伊利实业集团股份有限公司",1,2));

		list.add(new Person("15010419650317002X","19","19",1,1,1,"乌兰呼亨","内蒙古伊利实业集团股份有限公司",1,2));

		list.add(new Person("150105196502016529","19","19",1,1,1,"多丙杰","内蒙古伊利实业集团股份有限公司",1,2));

		list.add(new Person("150103196501190549","19","19",1,1,1,"白慧春","内蒙古伊利实业集团股份有限公司",1,2));

		list.add(new Person("150102196503053023","19","19",1,1,1,"戈文萍","内蒙古伊利实业集团股份有限公司",1,2));

		list.add(new Person("150104196501011025","19","19",1,1,1,"耿海梅","内蒙古伊利实业集团股份有限公司",1,2));



		list.add(new Person("150102196502250025","19","19",1,1,1,"周秀梅","内蒙古天元商贸股份有限公司",4,2));

		list.add(new Person("150102195502222011","19","19",1,1,1,"段广义","内蒙古师范大学赛罕后勤集团",4,1));

		list.add(new Person("150104195501102010","19","19",1,1,1,"王呼","内蒙古师范大学赛罕后勤集团",4,1));

		list.add(new Person("150102196501104528","19","19",1,1,1,"李金梅","内蒙古富恒房地产开发有限责任公司",2,2));

		list.add(new Person("150103196503062524","19","19",1,1,1,"王娟","内蒙古富恒房地产开发有限责任公司",2,2));

		list.add(new Person("150103196411190529","19","19",1,1,1,"梁云霄","内蒙古蒙亮民贸集团有限公司",2,2));

		list.add(new Person("150102196909103027","19","19",1,1,1,"王铮","内蒙古建筑勘察设计研究院有限责任公司",4,2));

		list.add(new Person("15010519650111002X","19","19",1,1,1,"谭云碧","内蒙古航天红峡化工有限公司",4,2));

		list.add(new Person("150105196503200029","19","19",1,1,1,"程桂云","内蒙古航天红峡化工有限公司",4,2));

		list.add(new Person("150104195502131518","19","19",1,1,1,"李勇","内蒙古航天红峡化工有限公司",4,1));

		list.add(new Person("150102195503054531","19","19",1,1,1,"李文元","内蒙古工业大学机械厂",4,1));

		list.add(new Person("150105196401230526","19","19",1,1,1,"张晓红","呼和浩特市园艺科技试验中心",4,2));

		list.add(new Person("150105195212260510","19","19",1,1,1,"张新民","呼和浩特市园艺科技试验中心",4,1));

		list.add(new Person("150102196401251125","19","19",1,1,1,"焦君淼","呼和浩特市园艺科技试验中心",4,2));

		list.add(new Person("150102196502254042","19","19",1,1,1,"牛丽","内蒙古交通物资有限责任公司",4,2));

		list.add(new Person("150103196501232526","19","19",1,1,1,"智美瑞","内蒙古中储物资储运有限责任公司",4,2));

		list.add(new Person("150103196503300027","19","19",1,1,1,"吴慧茹","内蒙古工大木器厂",4,2));

		list.add(new Person("15010519550318057X","19","19",1,1,1,"于见水","内蒙古工大木器厂",4,1));

		list.add(new Person("150104195502012017","19","19",1,1,1,"殷培智","内蒙古工大木器厂",4,1));

		list.add(new Person("150103196502191527","19","19",1,1,1,"郑慧琴","内蒙古金安达人力资源服务有限责任公司",2,2));

		list.add(new Person("150102196505191526","19","19",1,1,1,"张越萍","内蒙古金安达人力资源服务有限责任公司",2,2));

		list.add(new Person("150105195503130556","19","19",1,1,1,"卜贵旺","内蒙古方鼎金融企业服务有限责任公司",2,1));

		list.add(new Person("150102196501292522","19","19",1,1,1,"韩桂丽","内蒙古仕奇光华羊绒制品有限责任公司",1,2));

		list.add(new Person("150104196502040047","19","19",1,1,1,"郭俊清","内蒙古仕奇光华羊绒制品有限责任公司",1,2));

		list.add(new Person("150103196503171560","19","19",1,1,1,"王珍","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("150102195912103023","19","19",1,1,1,"刘艳文","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("150105196302260527","19","19",1,1,1,"高仙娥","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("150102195502010019","19","19",1,1,1,"白文玉","呼市城发投资经营有限责任公司",1,1));

		list.add(new Person("150102196502260522","19","19",1,1,1,"王慧","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("150103196003260524","19","19",1,1,1,"武丽英","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("150103196503162023","19","19",1,1,1,"赵建华","内蒙古金安达人力资源服务有限责任公司",1,2));

		list.add(new Person("150104196502080524","19","19",1,1,1,"张帆","中国外运内蒙古呼和浩特储运公司",4,2));

		list.add(new Person("150103196501271023","19","19",1,1,1,"张培连","呼和浩特市天辰佳恒商贸有限公司",2,2));

		list.add(new Person("150121196107082526","19","19",1,1,1,"武连云","呼和浩特经济技术开发区管委会",1,2));

		list.add(new Person("150103196501040524","19","19",1,1,1,"王小红","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150102196501092520","19","19",1,1,1,"张跃英","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150104196503232040","19","19",1,1,1,"陈爱仙","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("15010219580206051X","19","19",1,1,1,"王世义","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150104195403231513","19","19",1,1,1,"白成贵","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("152502195409220218","19","19",1,1,1,"黄文魁","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150103196502180545","19","19",1,1,1,"云成凤","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150104196702150021","19","19",1,1,1,"黄文革","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("152104196501211248","19","19",1,1,1,"杜林辉","内蒙古自治区公安厅出入境管理局",4,2));

		list.add(new Person("150102196502194529","19","19",1,1,1,"乌日哲","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150104196502160524","19","19",1,1,1,"邢国英","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150102195502063516","19","19",1,1,1,"武羚龙","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("15010419650202002X","19","19",1,1,1,"杨雪梅","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150104196504190022","19","19",1,1,1,"张建青","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150102196503221525","19","19",1,1,1,"闫玉英","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("15010419650310054X","19","19",1,1,1,"张旭龙","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150103195503101031","19","19",1,1,1,"张文斌","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150103195503191532","19","19",1,1,1,"杨晋湘","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150103196603081044","19","19",1,1,1,"云国艳","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150104195503140512","19","19",1,1,1,"梁栓柱","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150104196503060023","19","19",1,1,1,"吕俊萍","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150222195503013554","19","19",1,1,1,"杜生祥","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150102196502062040","19","19",1,1,1,"陈素仪","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150103195501261031","19","19",1,1,1,"冯茂","内蒙古银行股份有限公司",1,1));

		list.add(new Person("150105196502129021","19","19",1,1,1,"索粉粉","内蒙古银行股份有限公司",1,2));

		list.add(new Person("150102195502270013","19","19",1,1,1,"刘成元","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150103195501140010","19","19",1,1,1,"王浦源","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150104195502122013","19","19",1,1,1,"同光辉","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150102196502260020","19","19",1,1,1,"高金枝","呼和浩特中燃城市燃气发展有限公司",1,2));

		list.add(new Person("150102195501080058","19","19",1,1,1,"马军卫","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150104196502030025","19","19",1,1,1,"张素英","呼和浩特中燃城市燃气发展有限公司",1,2));

		list.add(new Person("150102195502183032","19","19",1,1,1,"李杰","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150105195503319017","19","19",1,1,1,"郝正雄","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150103195503250010","19","19",1,1,1,"徐仁飞","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150102195503260511","19","19",1,1,1,"杨志荣","呼和浩特中燃城市燃气发展有限公司",1,1));

		list.add(new Person("150103196503181523","19","19",1,1,1,"卜利平","呼和浩特中燃城市燃气发展有限公司",1,2));

		list.add(new Person("150103195502030518","19","19",1,1,1,"李春生","呼和浩特农业生产资料有限公司",1,1));

		list.add(new Person("150103195501100019","19","19",1,1,1,"张贵彪","内蒙古联合建工工程有限责任公司",2,1));

		list.add(new Person("150105196411051548","19","19",1,1,1,"萨仁其其格","际华五三零三服装有限公司",4,2));

		list.add(new Person("150103196811282123","19","19",1,1,1,"刘克贞","际华五三零三服装有限公司",4,2));

		list.add(new Person("152801196610252195","19","19",1,1,1,"淡贵明","际华五三零三服装有限公司",4,1));

		list.add(new Person("150102195503274016","19","19",1,1,1,"高润忠","内蒙古呼运集团有限责任公司",1,1));

		list.add(new Person("150104196504231525","19","19",1,1,1,"史素珍","内蒙古呼运集团有限责任公司",1,2));

		list.add(new Person("150103196501302520","19","19",1,1,1,"杨丽霞","内蒙古呼运集团有限责任公司",1,2));

		list.add(new Person("150103195501081030","19","19",1,1,1,"于子安","内蒙古呼运集团有限责任公司",1,1));

		list.add(new Person("150103195503010017","19","19",1,1,1,"唐文贵","内蒙古呼运集团有限责任公司",1,1));

		list.add(new Person("150102195501280535","19","19",1,1,1,"姚远","中房集团呼和浩特房地产开发公司",2,1));

		list.add(new Person("150102195503274518","19","19",1,1,1,"李志翔","内蒙古华盈科技投资有限公司",4,1));

		list.add(new Person("150122195503200514","19","19",1,1,1,"黄先柱","托克托电力有限责任公司",1,1));

		list.add(new Person("150122195503080516","19","19",1,1,1,"张广胜","托克托电力有限责任公司",1,1));

		list.add(new Person("150102196502164522","19","19",1,1,1,"鲍二月","内蒙古东元商贸实业有限责任公司",1,2));

		list.add(new Person("150103196502011047","19","19",1,1,1,"张丽荣","呼和浩特市睿城科技有限责任公司",1,2));

		list.add(new Person("150102196502154025","19","19",1,1,1,"闫月莲","内蒙古永恒实验物资有限公司",1,2));

		list.add(new Person("15010319650210004X","19","19",1,1,1,"许世丽","内蒙古兰太药业有限责任公司",1,2));

		list.add(new Person("150103196412241025","19","19",1,1,1,"刘秀萍","内蒙古兰太药业有限责任公司",1,2));

		list.add(new Person("150102195502124016","19","19",1,1,1,"兰蓉","内蒙古兰太药业有限责任公司",1,1));

		list.add(new Person("150102195910070117","19","19",1,1,1,"王铁山","内蒙古第二建设股份有限公司建发分公司",4,1));

		list.add(new Person("150102196501271545","19","19",1,1,1,"晓云","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("15010219600314202X","19","19",1,1,1,"林淑侠","呼市城发投资经营有限责任公司",1,2));

		list.add(new Person("150102196503292526","19","19",1,1,1,"邸凌雯","内蒙古银行股份有限公司呼和浩特分行",1,2));

		list.add(new Person("150102196001214560","19","19",1,1,1,"李丽英","内蒙古东元商贸实业有限责任公司",1,2));

		list.add(new Person("150102195501080517","19","19",1,1,1,"邢利岐","内蒙古民族商场有限责任公司",1,1));

		list.add(new Person("15010219551005453X","19","19",1,1,1,"王孝国","内蒙古民族商场有限责任公司",1,1));

		list.add(new Person("15010219660217404X","19","19",1,1,1,"王玲","内蒙古民族商场有限责任公司",1,2));

		list.add(new Person("150102196502094640","19","19",1,1,1,"张迎春","内蒙古民族商场有限责任公司",1,2));

		list.add(new Person("150104196502190547","19","19",1,1,1,"武学锋","内蒙古民族商场有限责任公司",1,2));

		list.add(new Person("150103195503291015","19","19",1,1,1,"张孝忠","内蒙古民族商场有限责任公司",1,1));

		list.add(new Person("150121195503082814","19","19",1,1,1,"李争平","内蒙古伊利实业集团股份有限公司（生活服务公司）",1,1));

		list.add(new Person("150104195503300555","19","19",1,1,1,"张照富","呼和浩特如意开发区公用事业有限公司",4,1));

		list.add(new Person("150102196501262083","19","19",1,1,1,"李建芬","内蒙古蒙建建筑安装工程有限责任公司",1,2));

		list.add(new Person("150104196001200057","19","19",1,1,1,"张保平","呼市机床电器厂",2,1));

		list.add(new Person("150102195503072019","19","19",1,1,1,"约斯图","内蒙古电影集团有限责任公司",4,1));

		list.add(new Person("150105196502179045","19","19",1,1,1,"韩青梅","内蒙古维多利超市连锁有限责任公司",2,2));

		list.add(new Person("150102196004204560","19","19",1,1,1,"陈素艳","中华联合财产保险股份有限公司内蒙古分公司",4,2));

		list.add(new Person("150105195302139036","19","19",1,1,1,"杨和平","金宇保灵生物药品有限公司",4,1));

		list.add(new Person("150102196502071529","19","19",1,1,1,"马淑萍","金宇保灵生物药品有限公司",4,2));

		list.add(new Person("150105195501229018","19","19",1,1,1,"额长春","金宇保灵生物药品有限公司",4,1));

		list.add(new Person("150102196502044029","19","19",1,1,1,"张珍萍","呼和浩特育彬人力资源服务有限责任公司",2,2));

		list.add(new Person("150103195502261017","19","19",1,1,1,"李鸿","内蒙古全景商务旅行社",2,1));

		list.add(new Person("150103195501180071","19","19",1,1,1,"王明才","内蒙古医科大学华丰旅馆",2,1));

		list.add(new Person("150102196501270067","19","19",1,1,1,"殷凤义","内蒙古新华发行集团股份有限公司",4,2));

		list.add(new Person("150102195501023512","19","19",1,1,1,"苏桓","内蒙古新华发行集团股份有限公司",4,1));

		list.add(new Person("150103195501181015","19","19",1,1,1,"许鹤明","呼和浩特市义鸣纸业印务有限公司",2,1));

		list.add(new Person("150103196503170023","19","19",1,1,1,"杨毅","内蒙古高等级公路建设开发有限责任公司呼和浩特分公司",2,2));

		list.add(new Person("15010219640224252X","19","19",1,1,1,"郎力华","内蒙古水月城温泉大酒店",1,2));

		list.add(new Person("150102196409270566","19","19",1,1,1,"白利杰","内蒙古康齐工贸股份有限公司",2,2));

		list.add(new Person("150102196404171542","19","19",1,1,1,"林梧霞","内蒙古及时雨典当有限公司",2,2));

		list.add(new Person("150102196502113522","19","19",1,1,1,"石娅丽","内蒙古正丰马铃薯种业股份有限公司",1,2));

		list.add(new Person("150102196503090027","19","19",1,1,1,"张晓红","内蒙古自治区盐业公司呼和浩特市分公司",4,2));

		list.add(new Person("15010319550226105X","19","19",1,1,1,"王和平","内蒙古自治区盐业公司呼和浩特市分公司",4,1));

		list.add(new Person("140102196303151241","19","19",1,1,1,"王莉","内蒙古云海消防工程有限责任公司",2,2));

		list.add(new Person("150105196203259037","19","19",1,1,1,"陈晓虎","内蒙古大学奥都资产经营有限责任公司",2,1));

		list.add(new Person("150105195501155012","19","19",1,1,1,"王日明","呼和浩特市万联人力资源服务有限公司",1,1));

		list.add(new Person("150104195501200059","19","19",1,1,1,"王毅力","内蒙古食全食美股份有限公司",1,1));

		list.add(new Person("150105195510279017","19","19",1,1,1,"李文汉","呼和浩特市儒达机械制造有限责任公司",1,1));

		list.add(new Person("15010219550116151X","19","19",1,1,1,"刘思华","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150102196507141522","19","19",1,1,1,"栗美云","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("15010219550222157X","19","19",1,1,1,"董铁铭","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150102195502120517","19","19",1,1,1,"富家骏","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150102196502231529","19","19",1,1,1,"孙桂英","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150102195503010037","19","19",1,1,1,"卜仁前","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150102195503081513","19","19",1,1,1,"孟新生","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150102196003072025","19","19",1,1,1,"孙慧","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150102196503100248","19","19",1,1,1,"吕金梅","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150102195504181516","19","19",1,1,1,"王青太","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("150103195502020512","19","19",1,1,1,"马惠民","内蒙古路桥有限责任公司",4,1));

		list.add(new Person("152801195503200336","19","19",1,1,1,"王赞和","中国石油内蒙古销售公司",4,1));

		list.add(new Person("150103196005202520","19","19",1,1,1,"马秀琴","中国平安财产保险股份有限公司内蒙古分公司",4,2));

		list.add(new Person("150105196501296522","19","19",1,1,1,"彭晓凤","内蒙古蒙达宾馆",4,2));

		list.add(new Person("150104196502030041","19","19",1,1,1,"李玉智","内蒙古禾嘉工贸有限公司",2,2));

		list.add(new Person("152634196502020027","19","19",1,1,1,"牛波","内蒙古自治区人力资源公共服务中心",4,2));

		list.add(new Person("150203196502111545","19","19",1,1,1,"刘月清","内蒙古伊利实业集团股份有限公司液态奶事业部金川厂",1,2));

		list.add(new Person("150104195501260510","19","19",1,1,1,"田益兵","中国石油天然气股份有限公司内蒙古呼和浩特销售分公司",1,1));

		list.add(new Person("150102195503030054","19","19",1,1,1,"闫海","中国石油天然气股份有限公司内蒙古呼和浩特销售分公司",1,1));

		list.add(new Person("150105195503031531","19","19",1,1,1,"云炜会","中国石油天然气股份有限公司内蒙古呼和浩特销售分公司",1,1));

		list.add(new Person("150102196502103025","19","19",1,1,1,"李凤兰","内蒙古伊利实业集团股份有限公司奶粉事业部",1,2));

		list.add(new Person("150102196601212083","19","19",1,1,1,"李娟","中央储备粮呼和浩特直属库",1,2));

		list.add(new Person("150103196502241520","19","19",1,1,1,"白金凤","中央储备粮呼和浩特直属库",1,2));

		list.add(new Person("150103196503012527","19","19",1,1,1,"包桂琴","内蒙古金宇集团股份有限公司",1,2));

		list.add(new Person("150102196503232021","19","19",1,1,1,"包屹华","内蒙古金宇集团股份有限公司",1,2));

		list.add(new Person("15010519550117351X","19","19",1,1,1,"赵幸福","赛罕区黄合少林场",2,1));

		list.add(new Person("15010519621126002X","19","19",1,1,1,"王利华","内蒙古兴原工程造价咨询有限责任公司",1,2));

		list.add(new Person("150102196003244528","19","19",1,1,1,"张淑华","内蒙古贸发粮油食品进出口有限责任公司",1,2));

		list.add(new Person("150102196502051544","19","19",1,1,1,"杨秀梅","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150103196501280042","19","19",1,1,1,"冯月菊","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150102196604264022","19","19",1,1,1,"王莉娟","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150102196502014129","19","19",1,1,1,"魏金兰","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150102195502100559","19","19",1,1,1,"马永富","呼和浩特富泰热力股份有限公司",1,1));

		list.add(new Person("150102196307172527","19","19",1,1,1,"李雅琴","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150102196502244020","19","19",1,1,1,"张仙芝","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150102196503042105","19","19",1,1,1,"刘洪玲","呼和浩特市宏舜羊绒制品有限公司",2,2));

		list.add(new Person("150104196501110023","19","19",1,1,1,"罗春花","呼和浩特市新畅铁路储运有限责任公司",2,2));

		list.add(new Person("142223196203067025","19","19",1,1,1,"张新爱","内蒙古金辉后勤服务中心金辉大酒店",1,2));

		list.add(new Person("150102196503274045","19","19",1,1,1,"刘君","呼和浩特市天利公路工程有限责任公司",1,2));

		
		

		list.add(new Person("15010519650104902X","19","19",1,1,1,"孔庆荣","呼和浩特金海工业园区管委会",2,2));

		

		list.add(new Person("150105195502099016","19","19",1,1,1,"张春德","呼和浩特市园林第二苗圃",2,1));

		list.add(new Person("150102195504202516","19","19",1,1,1,"郝和平","呼市第一面粉厂",1,1));

		list.add(new Person("150102195504143034","19","19",1,1,1,"孙致华","内蒙古群利祥通商贸有限公司",2,1));

		list.add(new Person("150102195506084541","19","19",1,1,1,"李秀莲","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150102195504112078","19","19",1,1,1,"牛德飞","呼和浩特市供排水有限责任公司",1,1));

		list.add(new Person("150103196504250543","19","19",1,1,1,"张爱先","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150102196504120523","19","19",1,1,1,"张惠娟","呼和浩特市供排水有限责任公司",1,2));

		list.add(new Person("150102196504071047","19","19",1,1,1,"张瑞先","内蒙古交通物资有限责任公司",4,2));

		list.add(new Person("150104196603071045","19","19",1,1,1,"贾玉玲","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150104196503070520","19","19",1,1,1,"张树丽","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150102196504253027","19","19",1,1,1,"孙长婷","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150104196504290525","19","19",1,1,1,"高秀春","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("152633196504220026","19","19",1,1,1,"王玲梅","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("15010219650419002X","19","19",1,1,1,"张桂芳","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150103196504182026","19","19",1,1,1,"王美仙","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150121196004168220","19","19",1,1,1,"鲁建萍","呼和浩特富泰热力股份有限公司",1,2));

		list.add(new Person("150103196504171028","19","19",1,1,1,"马丽娟","呼和浩特热电开发经营总公司",4,2));

		list.add(new Person("150102195504192514","19","19",1,1,1,"周存柱","中海石油天野化工有限责任公司",4,1));

		list.add(new Person("150104196004150024","19","19",1,1,1,"张晓中","中海石油天野化工有限责任公司",4,2));

		list.add(new Person("152630195504240015","19","19",1,1,1,"孙枝","中海石油天野化工有限责任公司",4,1));

		list.add(new Person("150102195504203017","19","19",1,1,1,"于伟光","中海石油天野化工有限责任公司",4,1));

		list.add(new Person("150103195503170037","19","19",1,1,1,"钱占忠","中共呼和浩特市委员会供暖处",2,1));

		list.add(new Person("150102195504253516","19","19",1,1,1,"安立秋","内蒙古工业大学机械厂",4,1));

		list.add(new Person("150102195504164513","19","19",1,1,1,"于兆灿","内蒙古工业大学机械厂",4,1));

		list.add(new Person("15010219550419451X","19","19",1,1,1,"曹建国","内蒙古工业大学机械厂",4,1));

		list.add(new Person("150103196501011029","19","19",1,1,1,"龙美铃","内蒙古呼运集团有限责任公司",1,2));

		list.add(new Person("150103196504070024","19","19",1,1,1,"郑丽华","内蒙古呼运集团有限责任公司",1,2));

		list.add(new Person("15010219601227151X","19","19",1,1,1,"王哲","内蒙古自治区人民防空建筑设计研究所",2,1));

		list.add(new Person("150104196504290023","19","19",1,1,1,"王艳华","内蒙古金安达人力资源服务有限责任公司",2,2));

		list.add(new Person("150103195504301051","19","19",1,1,1,"吕习建","内蒙古金安达人力资源服务有限责任公司",2,1));

		list.add(new Person("150102196409265011","19","19",1,1,1,"张庆东","内蒙古金宇集团股份有限公司",1,1));

		list.add(new Person("150105196504300523","19","19",1,1,1,"肖俊珍","呼和浩特春华威嘉水务运营有限责任公司",2,2));

		list.add(new Person("150102195501083515","19","19",1,1,1,"杨力群","呼和浩特经济技术开发区通和开发有限公司",1,1));

		list.add(new Person("150104196501010524","19","19",1,1,1,"张新兰","内蒙古新华发行集团股份有限公司呼和浩特市分公司",1,2));

		list.add(new Person("150102196004281523","19","19",1,1,1,"王岩","内蒙古电影集团有限责任公司",4,2));

		list.add(new Person("150104195504070018","19","19",1,1,1,"陈国喜","内蒙古电影集团有限责任公司",4,1));

		list.add(new Person("150103196504271547","19","19",1,1,1,"薛秀梅","呼和浩特市城市规划技术服务中心",2,2));

		list.add(new Person("150102196002250563","19","19",1,1,1,"李玉霞","呼和浩特市建筑勘察设计研究院有限责任公司",2,2));

		list.add(new Person("150103195504172018","19","19",1,1,1,"杨润喜","中央储备粮呼和浩特直属库",1,1));

		list.add(new Person("150102195501110018","19","19",1,1,1,"色旺吉格吉德","内蒙古人民出版社",4,1));

		list.add(new Person("150102196312020157","19","19",1,1,1,"莫日根巴特尔","内蒙古人民出版社",4,1));

		list.add(new Person("15010219550219003X","19","19",1,1,1,"李杰","内蒙古人民出版社",4,1));

		list.add(new Person("150105195504061513","19","19",1,1,1,"郑种科","中国外运内蒙古呼和浩特储运公司",4,1));

		list.add(new Person("150102195504293016","19","19",1,1,1,"王建平","中国外运内蒙古呼和浩特储运公司",4,1));

		list.add(new Person("150103196503081522","19","19",1,1,1,"李祥玲","深圳健安医药有限公司",2,2));

		list.add(new Person("150104195501050513","19","19",1,1,1,"杨炳彦","内蒙古昭华建筑工程（集团）有限责任公司",2,1));

		list.add(new Person("15010519550412051X","19","19",1,1,1,"康奎连","内蒙古自治区社会科学院",2,1));

		list.add(new Person("150105196504190520","19","19",1,1,1,"白玉梅","呼和浩特市赛罕区东苗圃",2,2));

		list.add(new Person("150104195504080515","19","19",1,1,1,"贾富强","内蒙古如保诚人力资源管理有限公司",2,1));

		list.add(new Person("150102196604273025","19","19",1,1,1,"王瑞青","呼和浩特日报社印刷厂",2,2));

		list.add(new Person("150105195504190016","19","19",1,1,1,"丁建平","内蒙古航天红岗机械有限公司",4,1));

		list.add(new Person("150105196504090028","19","19",1,1,1,"杨芳","内蒙古航天红岗机械有限公司",4,2));

		list.add(new Person("152625196504250022","19","19",1,1,1,"郭秀娥","内蒙古蒙达宾馆",4,2));

		list.add(new Person("150104195704152018","19","19",1,1,1,"赵存喜","呼市皮革总厂",2,1));

		list.add(new Person("150102195502061510","19","19",1,1,1,"王满库","呼和浩特市住房保障和房屋管理局供暖管理处",2,1));

		list.add(new Person("150102196501024544","19","19",1,1,1,"乌兰","内蒙古公安厅印刷厂",2,2));

		list.add(new Person("150105196504140021","19","19",1,1,1,"赵萍","内蒙古航天红峡化工有限公司",1,2));

		list.add(new Person("150102196503252065","19","19",1,1,1,"解秀敏","内蒙古医院劳动服务公司",2,2));

		list.add(new Person("150102195503084511","19","19",1,1,1,"孟民生","内蒙古东鸽电器集团有限责任公司",1,1));

		list.add(new Person("15010319650404052X","19","19",1,1,1,"敖登高娃","内蒙古通达实业股份有限公司",2,2));

		list.add(new Person("150102195504120019","19","19",1,1,1,"张国斌","内蒙古通达实业股份有限公司",2,1));

		list.add(new Person("150102196501060043","19","19",1,1,1,"李仙云","呼和浩特市华博物业服务有限责任公司",2,2));

		list.add(new Person("150102196005222525","19","19",1,1,1,"侯益俍","内蒙古住友建设发展有限责任公司",1,2));

		list.add(new Person("150102195504113011","19","19",1,1,1,"高延年","内蒙古住友建设发展有限责任公司",1,1));

		list.add(new Person("150202196504090366","19","19",1,1,1,"郭永宏","内蒙古谂达会计师事务所有限责任公司",2,2));

		list.add(new Person("15010319490815011X","19","19",1,1,1,"关胜南","内蒙古河洋律师事务所",4,1));

		list.add(new Person("150103195504081511","19","19",1,1,1,"刘新民","内蒙古兰太药业有限责任公司",1,1));

		list.add(new Person("152634196003010027","19","19",1,1,1,"苏琴英","内蒙古自治区气象局机关服务中心",4,2));

		list.add(new Person("150102196504242045","19","19",1,1,1,"霍桂枝","内蒙古蒙建建筑安装工程有限责任公司",1,2));

		list.add(new Person("152626195501130019","19","19",1,1,1,"武占全","创维电子（内蒙古）有限公司",1,1));

		list.add(new Person("150102196505143022","19","19",1,1,1,"石梅玲","内蒙古青山乳液有限责任公司",1,2));

		list.add(new Person("150104195504220012","19","19",1,1,1,"杨春生","内蒙古大天酒店有限责任公司",2,1));

		list.add(new Person("150102196503253041","19","19",1,1,1,"代霞","内蒙古巨华集团大华建筑安装有限公司",2,2));

		list.add(new Person("150105195503290015","19","19",1,1,1,"白明","中国河西化工机械公司四十六所",4,1));

		list.add(new Person("150102195604223015","19","19",1,1,1,"曾显孟","内蒙古建筑勘察设计研究院有限责任公司",4,1));

		list.add(new Person("150102196501262120","19","19",1,1,1,"刘桂莲","呼和浩特市女神餐饮娱乐有限公司",1,2));

		list.add(new Person("150103195503132030","19","19",1,1,1,"徐效忠","呼和浩特市园林第三苗圃",2,1));

		list.add(new Person("15010219680406456X","19","19",1,1,1,"吴英","呼和浩特日报社发行总站",2,2));

		list.add(new Person("150105196504227848","19","19",1,1,1,"韩翠梅","呼和浩特日报社发行总站",2,2));

		list.add(new Person("150102196501222081","19","19",1,1,1,"陈和平","呼市嘉诚物业服务有限责任公司",1,2));

		list.add(new Person("150102195501184519","19","19",1,1,1,"王大东","内蒙古铁骑投资控股集团有限公司",1,1));

		list.add(new Person("150104196404230525","19","19",1,1,1,"栗静","内蒙古铁骑投资控股集团有限公司",1,2));

		list.add(new Person("150102196503253025","19","19",1,1,1,"胡英","内蒙古莱得贝尔能源环保技术工程有限公司",2,2));

		list.add(new Person("150102196502260047","19","19",1,1,1,"牛翠萍","国家统计局内蒙古调查总队",4,2));

		list.add(new Person("150103195504071057","19","19",1,1,1,"宋治强","内蒙古新华发行集团股份有限公司",4,1));

		list.add(new Person("150102196505233044","19","19",1,1,1,"于俊麟","内蒙古维多利商业（集团）有限公司",2,2));

		list.add(new Person("150102196504031520","19","19",1,1,1,"赵雄亚","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150104196504140041","19","19",1,1,1,"李玲枝","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150102196504041542","19","19",1,1,1,"徐思婷","内蒙古路桥有限责任公司",4,2));

		list.add(new Person("150103195505102011","19","19",1,1,1,"霍云举","内蒙古维多利超市连锁有限责任公司",2,1));

		list.add(new Person("152801195410170932","19","19",1,1,1,"庄宏斌","内蒙古高等级公路建设开发有限责任公司",2,1));

		list.add(new Person("150102195502031514","19","19",1,1,1,"刘永祥","内蒙古高等级公路建设开发有限责任公司",2,1));

		list.add(new Person("150102196001283523","19","19",1,1,1,"王丽","内蒙古高等级公路建设开发有限责任公司",2,2));

		list.add(new Person("150105196501230021","19","19",1,1,1,"吴彦萍","内蒙古河西航天科技发展有限公司",4,2));

		list.add(new Person("15010219550811453X","19","19",1,1,1,"李福元","呼市公路工程局",2,1));

		list.add(new Person("150103196504112028","19","19",1,1,1,"扆晓春","内蒙古纺织技工学校",2,2));

		list.add(new Person("15010519620429052X","19","19",1,1,1,"张秀清","呼和浩特市东瓦窑农副产品批发市场",2,2));

		list.add(new Person("150103195502182538","19","19",1,1,1,"张青春","呼市建筑工程有限责任公司",1,1));

		list.add(new Person("150104195501010511","19","19",1,1,1,"王元生","呼市建筑工程有限责任公司",1,1));

		list.add(new Person("150924195502033132","19","19",1,1,1,"朱海","呼市建筑工程有限责任公司",1,1));

		list.add(new Person("150102196507141020","19","19",1,1,1,"任凤娟","呼市建筑工程有限责任公司",1,2));

		list.add(new Person("150104196502051037","19","19",1,1,1,"吴敬孝","呼市建筑工程有限责任公司",1,1));

		list.add(new Person("150105196303209029","19","19",1,1,1,"范玉君","呼市建筑工程有限责任公司",1,2));

		list.add(new Person("150104196501262027","19","19",1,1,1,"徐桂荣","内蒙古鼎盛华房地产开发有限公司",2,2));

		list.add(new Person("150102195504152512","19","19",1,1,1,"刘久喜","内蒙古金岁实业有限责任公司大酒店",1,1));

		list.add(new Person("150104195501230012","19","19",1,1,1,"智维东","呼和浩特钢铁厂",4,1));

		list.add(new Person("150103195502061015","19","19",1,1,1,"范生富","呼和浩特钢铁厂",4,1));

		list.add(new Person("239004196502094726","19","19",1,1,1,"郭淑华","呼和浩特钢铁厂",4,2));

		list.add(new Person("150103195504021033","19","19",1,1,1,"刘新民","呼和浩特钢铁厂",4,1));

		list.add(new Person("152631195504230032","19","19",1,1,1,"寇君","呼和浩特钢铁厂",4,1));

		list.add(new Person("150103196404171047","19","19",1,1,1,"刘团园","呼和浩特钢铁厂",4,2));

		list.add(new Person("150104196503030529","19","19",1,1,1,"石秀清","呼和浩特钢铁厂",4,2));

		list.add(new Person("150104196302200026","19","19",1,1,1,"曹林燕","呼和浩特钢铁厂",4,2));

		list.add(new Person("150105196503119044","19","19",1,1,1,"张素霞","呼和浩特钢铁厂",4,2));

		list.add(new Person("150103196503231025","19","19",1,1,1,"张智琼","呼和浩特钢铁厂",4,2));

		list.add(new Person("150102195503173012","19","19",1,1,1,"李焱","内蒙古亿同建设工程监理有限责任公司",2,1));

		list.add(new Person("150102196504091523","19","19",1,1,1,"陈宏","内蒙古饭店有限责任公司",1,2));


		list.add(new Person("150103195503290514","19","19",1,1,1,"张少慧","内蒙古绿泰源农产品开发股份有限公司",4,1));

		list.add(new Person("150104195501292010","19","19",1,1,1,"高锦象","内蒙古昆明卷烟有限责任公司",1,1));

		list.add(new Person("150102196001281026","19","19",1,1,1,"杨跃峰","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150104195401020536","19","19",1,1,1,"陈洪滨","内蒙古昆明卷烟有限责任公司",1,1));

		list.add(new Person("150104195502010572","19","19",1,1,1,"陈建庭","内蒙古昆明卷烟有限责任公司",1,1));

		list.add(new Person("150105195501222019","19","19",1,1,1,"云长生","内蒙古昆明卷烟有限责任公司",1,1));

		list.add(new Person("15010319650228052X","19","19",1,1,1,"马艳玲","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150105196603049047","19","19",1,1,1,"刘桂英","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150104196503130546","19","19",1,1,1,"马淑萍","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150104196503270549","19","19",1,1,1,"王艳华","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150104195504251513","19","19",1,1,1,"许佩文","内蒙古昆明卷烟有限责任公司",1,1));

		list.add(new Person("150104196505020527","19","19",1,1,1,"周艳英","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150102196504121526","19","19",1,1,1,"何文秀","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("150103196002080513","19","19",1,1,1,"李建华","内蒙古润创冷链物流有限责任公司",4,1));

		list.add(new Person("150105196504229026","19","19",1,1,1,"梁彦玲","金宇保灵生物药品有限责任公司",4,2));

		list.add(new Person("150104196504230020","19","19",1,1,1,"冉慧","金宇保灵生物药品有限责任公司",4,2));

		list.add(new Person("15010519650411902X","19","19",1,1,1,"孙晓玲","金宇保灵生物药品有限责任公司",4,2));

		list.add(new Person("150102195504052511","19","19",1,1,1,"王天富","金宇保灵生物药品有限责任公司",4,1));

		list.add(new Person("150103195504080017","19","19",1,1,1,"任国兴","金宇保灵生物药品有限责任公司",4,1));

		list.add(new Person("150104196504230565","19","19",1,1,1,"王淑娟","内蒙古蒙吉利经济技术开发股份有限公司",4,2));

		list.add(new Person("150102196003060526","19","19",1,1,1,"杜玉华","内蒙古交通设计研究院有限责任公司",4,2));

		list.add(new Person("150102195404230579","19","19",1,1,1,"丁庆兴","内蒙古交通设计研究院有限责任公司",4,1));

		list.add(new Person("150103195504271518","19","19",1,1,1,"李元峰","内蒙古交通设计研究院有限责任公司",4,1));

		list.add(new Person("150103195911090562","19","19",1,1,1,"田超","内蒙古广播电视器材公司",4,2));

		list.add(new Person("15010519620901054X","19","19",1,1,1,"刘连秀","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("150105196306050527","19","19",1,1,1,"张娥香","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("150105196310100523","19","19",1,1,1,"张艳霞","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("150105196202010563","19","19",1,1,1,"郭慧敏","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("152629196503183521","19","19",1,1,1,"王兰英","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("150105196302230627","19","19",1,1,1,"李改凤","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("15010519630301052X","19","19",1,1,1,"张粉团","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("150105196308070548","19","19",1,1,1,"李根梅","呼和浩特市东瓦窑农副产品批发市场",4,2));

		list.add(new Person("150104196504020525","19","19",1,1,1,"燕冬梅","内蒙古银行股份有限公司",1,2));

		list.add(new Person("150103196504181541","19","19",1,1,1,"白兰明","内蒙古民族商场有限责任公司",1,2));

		list.add(new Person("150102196504212022","19","19",1,1,1,"柳景辉","内蒙古大学",4,2));

		list.add(new Person("150104195504060012","19","19",1,1,1,"韩成山","内蒙古大学",4,1));

		list.add(new Person("150102196404304528","19","19",1,1,1,"张秀梅","中国人民解放军66265部队",1,2));

		list.add(new Person("15010219520703451X","19","19",1,1,1,"王拖应","中国人民解放军66265部队",1,1));

		list.add(new Person("150105195304201534","19","19",1,1,1,"李二柒","中国人民解放军66265部队",1,1));

		list.add(new Person("150105196504119046","19","19",1,1,1,"胡岩","内蒙古雅元经贸有限公司",1,2));

		list.add(new Person("150102195504154534","19","19",1,1,1,"史连秀","内蒙古维克多利纸业股份有限公司",2,1));

		list.add(new Person("150105196412233044","19","19",1,1,1,"张传荣","呼和浩特市公主府公园管理处",2,2));

		list.add(new Person("150103196504132520","19","19",1,1,1,"贾妮","内蒙古东元商贸实业有限责任公司",1,2));

		list.add(new Person("150103195404012535","19","19",1,1,1,"刘志文","内蒙古昭君大酒店有限责任公司",1,1));

		list.add(new Person("150103196004220022","19","19",1,1,1,"赵亚丽","内蒙古昭君大酒店有限责任公司",1,2));

		list.add(new Person("150104195502221011","19","19",1,1,1,"王快元","呼和浩特市绕城道路绿化管理处",2,1));

		list.add(new Person("150104195502170533","19","19",1,1,1,"姚志忠","呼和浩特市绕城道路绿化管理处",2,1));

		list.add(new Person("150103195502190570","19","19",1,1,1,"次琨","呼和浩特市绕城道路绿化管理处",2,1));

		list.add(new Person("150102195503184539","19","19",1,1,1,"陈振东","内蒙古蒙吉利经济技术开发股份有限公司",4,1));

		list.add(new Person("15010219650129304X","19","19",1,1,1,"胡秀珍","内蒙古天瑞得物业服务有限公司",1,2));

		list.add(new Person("150102196504144023","19","19",1,1,1,"赵均波","内蒙古安华科技有限公司",2,2));

		list.add(new Person("150102196504202561","19","19",1,1,1,"李婷","玉泉区老王记饭店",2,2));

		list.add(new Person("150103196501170126","19","19",1,1,1,"刘湘凤","玉泉区老王记饭店",2,2));

		list.add(new Person("150103196501121543","19","19",1,1,1,"丁美英","内蒙古宏立达橡塑机械有限责任公司",1,2));

		list.add(new Person("150103196501021526","19","19",1,1,1,"任牡丹","内蒙古宏立达橡塑机械有限责任公司",1,2));

		list.add(new Person("150103196502281549","19","19",1,1,1,"董青","内蒙古宏立达橡塑机械有限责任公司",1,2));

		list.add(new Person("150103196404211520","19","19",1,1,1,"申丽霞","内蒙古宏立达橡塑机械有限责任公司",1,2));

		list.add(new Person("150105196204060521","19","19",1,1,1,"史永华","际华5303服装有限公司",4,2));

		list.add(new Person("150105196504047820","19","19",1,1,1,"张颖","内蒙古昆明卷烟有限责任公司",1,2));

		list.add(new Person("15010319550402201X","19","19",1,1,1,"祁子鸣","呼和浩特市惠生物业服务有限责任公司",2,1));

		list.add(new Person("150102196501032528","19","19",1,1,1,"徐建玲","呼和浩特市园林科研植保站",2,2));

		list.add(new Person("150102195501044516","19","19",1,1,1,"毛建国","呼和浩特市博华人力资源有限公司",2,1));

		list.add(new Person("150102196502044045","19","19",1,1,1,"刘双凤","内蒙古建筑职业技术学院（内蒙古自治区建筑职工培训中心）",4,2));

		list.add(new Person("150102195504114516","19","19",1,1,1,"奇博尔","中国石油内蒙古销售公司",4,1));

		list.add(new Person("150103195503280519","19","19",1,1,1,"宋和平","内蒙古广播电视器材公司",4,1));

		list.add(new Person("150103196501201527","19","19",1,1,1,"贾秀兰","呼和浩特市醇丰酒业有限责任公司",2,2));

		list.add(new Person("15010219650421452X","19","19",1,1,1,"高燕","内蒙古乾坤金银精炼股份有限公司",4,2));

		list.add(new Person("150102195502094515","19","19",1,1,1,"郑子龙","内蒙古汇能人力资源有限责任公司",2,1));

		list.add(new Person("150104196504100023","19","19",1,1,1,"刘效荣","内蒙古银行股份有限公司呼和浩特分行",1,2));

		list.add(new Person("150102196503214026","19","19",1,1,1,"王雅菲","内蒙古新城宾馆旅游业集团有限责任公司",4,2));


		list.add(new Person("150103196412261026","19","19",1,1,1,"范淑兰","原",3,2));

		list.add(new Person("150105197012129023","19","19",1,1,1,"范润梅","原",3,2));

		list.add(new Person("150103195510031510","19","19",1,1,1,"代根和","原",3,1));

		list.add(new Person("150103196403081023","19","19",1,1,1,"于淑梅","原",3,2));

		list.add(new Person("150104196211290011","19","19",1,1,1,"李兴强","原",3,1));

		list.add(new Person("152823196403020023","19","19",1,1,1,"刘霞","原",3,2));

		list.add(new Person("150103195405042517","19","19",1,1,1,"刘世强","原",3,1));

		list.add(new Person("150104196404120027","19","19",1,1,1,"李风云","原",3,2));

		list.add(new Person("150104195407140539","19","19",1,1,1,"王维军","原",3,1));

		list.add(new Person("150102195506063513","19","19",1,1,1,"宁肖原","原",3,1));

		list.add(new Person("15010219540608101X","19","19",1,1,1,"李宝伟","原",3,1));

		list.add(new Person("15010219640317002X","19","19",1,1,1,"张娟","原",3,2));

		list.add(new Person("150102196404174524","19","19",1,1,1,"史云平","原",3,2));

		list.add(new Person("150102196506062523","19","19",1,1,1,"王丽华","原",3,2));

		list.add(new Person("150102195405281511","19","19",1,1,1,"杨建国","原",3,1));

		list.add(new Person("150104196404090542","19","19",1,1,1,"李惠玲","原",3,2));

		list.add(new Person("150104195406170058","19","19",1,1,1,"王耀华","原",3,1));

		list.add(new Person("150104195403152516","19","19",1,1,1,"贾绥锁","原",3,1));

		list.add(new Person("150104196401141025","19","19",1,1,1,"苟润兰","原",3,2));

		list.add(new Person("150105196404287325","19","19",1,1,1,"王桂梅","原",3,2));

		list.add(new Person("150104195406171018","19","19",1,1,1,"刘贵林","原",3,1));

		list.add(new Person("150104195401161515","19","19",1,1,1,"金伟民","原",3,1));

		list.add(new Person("150102195406234514","19","19",1,1,1,"张贺成","原",3,1));

		list.add(new Person("150102196406110540","19","19",1,1,1,"李翠兰","原",3,2));

		list.add(new Person("150104196405091029","19","19",1,1,1,"姚进玲","原",3,2));

		list.add(new Person("150102195403180557","19","19",1,1,1,"张焕发","原",3,1));

		list.add(new Person("150102196403274021","19","19",1,1,1,"常秀玲","原",3,2));

		list.add(new Person("150103196402281568","19","19",1,1,1,"蒋传风","原",3,2));

		list.add(new Person("15010319640618102X","19","19",1,1,1,"李桂兰","原",3,2));

		list.add(new Person("150103195406052012","19","19",1,1,1,"李贵成","原",3,1));

		list.add(new Person("150103195401020513","19","19",1,1,1,"陈忠华","原",3,1));

		list.add(new Person("150104195406200536","19","19",1,1,1,"刘启亮","原",3,1));

		list.add(new Person("150102196406202525","19","19",1,1,1,"巩建利","原",3,2));

		list.add(new Person("150103196406014600","19","19",1,1,1,"高二秀","原",3,2));

		list.add(new Person("150104196002200024","19","19",1,1,1,"李秀清","原",3,2));

		list.add(new Person("150102195406230011","19","19",1,1,1,"李春明","原",3,1));

		list.add(new Person("150102195401121510","19","19",1,1,1,"付连锁","原",3,1));

		list.add(new Person("150103196406102029","19","19",1,1,1,"白小平","原",3,2));

		list.add(new Person("150102196402253026","19","19",1,1,1,"赵建荣","原",3,2));

		list.add(new Person("150104196401161042","19","19",1,1,1,"皇甫利花","原",3,2));

		list.add(new Person("150102195402140510","19","19",1,1,1,"燕子荣","原",3,1));

		list.add(new Person("150102196406023025","19","19",1,1,1,"栾艳娜","原",3,2));

		list.add(new Person("150102195402030012","19","19",1,1,1,"姚向明","原",3,1));

		list.add(new Person("150102195404114017","19","19",1,1,1,"白志军","原",3,1));

		list.add(new Person("150104196402030546","19","19",1,1,1,"马锐","原",3,2));

		list.add(new Person("15010219640612052X","19","19",1,1,1,"李彬","原",3,2));

		list.add(new Person("150104196405250042","19","19",1,1,1,"魏金莲","原",3,2));

		list.add(new Person("150103196401142523","19","19",1,1,1,"王文燕","原",3,2));

		list.add(new Person("150102196404204527","19","19",1,1,1,"鲁芸","原",3,2));

		list.add(new Person("150156196405109045","19","19",1,1,1,"袁秀茹","原",3,2));

		list.add(new Person("150102195406020030","19","19",1,1,1,"孙建川","原",3,1));

		list.add(new Person("150103195403122513","19","19",1,1,1,"白世贵","原",3,1));

		list.add(new Person("150104196401070589","19","19",1,1,1,"杨雪棠","原",3,2));

		list.add(new Person("150102196402102527","19","19",1,1,1,"陈丽华","原",3,2));

		list.add(new Person("150103195403192036","19","19",1,1,1,"谢锁牛","原",3,1));

		list.add(new Person("150104196405160020","19","19",1,1,1,"郭慧敏","原",3,2));

		list.add(new Person("150102196405260029","19","19",1,1,1,"刘存兰","原",3,2));

		list.add(new Person("150102195406092018","19","19",1,1,1,"刘宝胜","原",3,1));

		list.add(new Person("152621195402150012","19","19",1,1,1,"杜建业","原",3,1));

		list.add(new Person("150102195306140510","19","19",1,1,1,"毛润喜","原",3,1));

		list.add(new Person("150102195403134016","19","19",1,1,1,"杨贵文","原",3,1));

		list.add(new Person("150103196405162089","19","19",1,1,1,"马建梅","原",3,2));

		list.add(new Person("150105196404270523","19","19",1,1,1,"焦红梅","原",3,2));

		list.add(new Person("150103196406141028","19","19",1,1,1,"曾妍芳","原",3,2));

		list.add(new Person("150103195406052514","19","19",1,1,1,"刘世华","原",3,1));

		list.add(new Person("150104196406220523","19","19",1,1,1,"王敬华","原",3,2));

		list.add(new Person("150102196404251526","19","19",1,1,1,"贾萍","原",3,2));

		list.add(new Person("150103196403290546","19","19",1,1,1,"胡伟琴","原",3,2));

		list.add(new Person("15010219640604052X","19","19",1,1,1,"张树梅","原",3,2));

		list.add(new Person("150102195403012510","19","19",1,1,1,"岳贵恒","原",3,1));

		list.add(new Person("150102196406011024","19","19",1,1,1,"塔娜","原",3,2));

		list.add(new Person("150102196406063027","19","19",1,1,1,"杨彩霞","原",3,2));

		list.add(new Person("150104196406030543","19","19",1,1,1,"耿洪禹","原",3,2));

		list.add(new Person("150104196406230545","19","19",1,1,1,"李桂英","原",3,2));

		list.add(new Person("150103196401122020","19","19",1,1,1,"周玉珍","原",3,2));

		list.add(new Person("150102196403230520","19","19",1,1,1,"武美荣","原",3,2));

		list.add(new Person("150102196402281027","19","19",1,1,1,"图娅","原",3,2));

		list.add(new Person("150104195406260010","19","19",1,1,1,"陈茂林","原",3,1));

		list.add(new Person("150104196311260522","19","19",1,1,1,"金花","原",3,2));

		list.add(new Person("150103195403140017","19","19",1,1,1,"云文清","原",3,1));

		list.add(new Person("150105196402250529","19","19",1,1,1,"岳美兰","原",3,2));

		list.add(new Person("150105196403180526","19","19",1,1,1,"刘春英","原",3,2));

		list.add(new Person("150104196608060521","19","19",1,1,1,"王万英","原",3,2));

		list.add(new Person("150103195404301038","19","19",1,1,1,"毛进伟","原",3,1));

		list.add(new Person("150103196406181046","19","19",1,1,1,"康秀清","原",3,2));

		list.add(new Person("150102196405222567","19","19",1,1,1,"王银梅","原",3,2));

		list.add(new Person("150102195406170514","19","19",1,1,1,"李英栋","原",3,1));

		list.add(new Person("150102196405022565","19","19",1,1,1,"马晓军","原",3,2));

		list.add(new Person("150104196406040020","19","19",1,1,1,"李萍","原",3,2));

		list.add(new Person("150102196406104028","19","19",1,1,1,"杜丽艳","原",3,2));

		list.add(new Person("150104196404250024","19","19",1,1,1,"张福香","原",3,2));

		list.add(new Person("150105195401109035","19","19",1,1,1,"姜润民","原",3,1));

		list.add(new Person("150102196401312522","19","19",1,1,1,"李月香","原",3,2));

		list.add(new Person("150102196406104546","19","19",1,1,1,"杨庆凤","原",3,2));

		list.add(new Person("150104195402200010","19","19",1,1,1,"赵秀月","原",3,1));

		list.add(new Person("150103196703010024","19","19",1,1,1,"李燕","原",3,2));

		list.add(new Person("150102196402051029","19","19",1,1,1,"赵洁","原",3,2));

		list.add(new Person("150104196406131520","19","19",1,1,1,"金秀英","原",3,2));

		list.add(new Person("15010319540613101X","19","19",1,1,1,"高成龙","原",3,1));

		list.add(new Person("150102196405064642","19","19",1,1,1,"周建秀","原",3,2));

		list.add(new Person("150105196403319049","19","19",1,1,1,"王玉珍","原",3,2));

		list.add(new Person("150103196402132028","19","19",1,1,1,"赵素芳","原",3,2));

		list.add(new Person("150104196012190018","19","19",1,1,1,"谭龙臣","原",3,1));

		list.add(new Person("150102196401230527","19","19",1,1,1,"苗素琴","原",3,2));

		list.add(new Person("150104196402212024","19","19",1,1,1,"陈连梅","原",3,2));

		list.add(new Person("150105196401290545","19","19",1,1,1,"张荣爱","原",3,2));

		list.add(new Person("150104195402131510","19","19",1,1,1,"董全才","原",3,1));

		list.add(new Person("150103196406111048","19","19",1,1,1,"刘凤英","原",3,2));

		list.add(new Person("150102195406183518","19","19",1,1,1,"陈林旺","原",3,1));

		list.add(new Person("150102195406042539","19","19",1,1,1,"何文刚","原",3,1));

		list.add(new Person("150105196403307822","19","19",1,1,1,"何荣","原",3,2));

		list.add(new Person("150105196401058324","19","19",1,1,1,"郝淑琴","原",3,2));

		list.add(new Person("150103196406231525","19","19",1,1,1,"马秀花","原",3,2));

		list.add(new Person("150103195406032513","19","19",1,1,1,"白金魁","原",3,1));

		list.add(new Person("150103195406051511","19","19",1,1,1,"杨端生","原",3,1));

		list.add(new Person("150104196405150551","19","19",1,1,1,"斯庆毕力格","原",3,1));

		list.add(new Person("15010219640317352X","19","19",1,1,1,"陈汀","原",3,2));

		list.add(new Person("150102196801062542","19","19",1,1,1,"乔美莲","原",3,2));

		list.add(new Person("150102196405174024","19","19",1,1,1,"沈淑英","原",3,2));

		list.add(new Person("150103195402232016","19","19",1,1,1,"公小平","原",3,1));

		list.add(new Person("15010219640112162X","19","19",1,1,1,"杜建荣","原",3,2));

		list.add(new Person("150104196406250044","19","19",1,1,1,"赵桂芳","原",3,2));

		list.add(new Person("150104196401140540","19","19",1,1,1,"蔡建英","原",3,2));

		list.add(new Person("150102196403022107","19","19",1,1,1,"麻春梅","原",3,2));

		list.add(new Person("150104196406011027","19","19",1,1,1,"党存荣","原",3,2));

		list.add(new Person("152524196406040628","19","19",1,1,1,"任利风","原",3,2));

		list.add(new Person("150105196406129021","19","19",1,1,1,"张鲜梅","原",3,2));

		list.add(new Person("150102196401173024","19","19",1,1,1,"冯俊玲","原",3,2));

		list.add(new Person("150103196402150103","19","19",1,1,1,"尤晓璐","原",3,2));

		list.add(new Person("150103196404190547","19","19",1,1,1,"范秀枝","原",3,2));

		list.add(new Person("150102196404291528","19","19",1,1,1,"王小生","原",3,2));

		list.add(new Person("150102196403152542","19","19",1,1,1,"杨景风","原",3,2));

		list.add(new Person("150102195406024517","19","19",1,1,1,"马德英","原",3,1));

		list.add(new Person("150103196401181100","19","19",1,1,1,"张丽娟","原",3,2));

		list.add(new Person("150104195405260035","19","19",1,1,1,"李建国","原",3,1));

		list.add(new Person("150102196406061523","19","19",1,1,1,"赵金梅","原",3,2));

		list.add(new Person("150102196402070545","19","19",1,1,1,"刘美凤","原",3,2));

		list.add(new Person("150103196401171025","19","19",1,1,1,"马桂英","原",3,2));

		list.add(new Person("150103195401282011","19","19",1,1,1,"赵广福","原",3,1));

		list.add(new Person("150102196401280567","19","19",1,1,1,"李美玲","原",3,2));

		list.add(new Person("150102195405171515","19","19",1,1,1,"杜海平","原",3,1));

		list.add(new Person("150103195402222037","19","19",1,1,1,"裴桂柱","原",3,1));

		list.add(new Person("150104196406041541","19","19",1,1,1,"李金燕","原",3,2));

		list.add(new Person("150102196403244041","19","19",1,1,1,"李眉洁","原",3,2));

		list.add(new Person("15010219540609251X","19","19",1,1,1,"党茂盛","原",3,1));

		list.add(new Person("150102195406103012","19","19",1,1,1,"何乃康","原",3,1));

		list.add(new Person("150102196403240542","19","19",1,1,1,"邵桂芝","原",3,2));

		list.add(new Person("150104196406250060","19","19",1,1,1,"曾秀琴","原",3,2));

		list.add(new Person("150103196406171024","19","19",1,1,1,"周春兰","原",3,2));

		list.add(new Person("150103196401221045","19","19",1,1,1,"张淑华","原",3,2));

		list.add(new Person("150102195403172514","19","19",1,1,1,"边建国","原",3,1));

		list.add(new Person("150104196404100528","19","19",1,1,1,"刘慧兰","原",3,2));

		list.add(new Person("150104196403221029","19","19",1,1,1,"张新玲","原",3,2));

		list.add(new Person("150105196401147829","19","19",1,1,1,"张秀荣","原",3,2));

		list.add(new Person("150103195403062514","19","19",1,1,1,"马贵","原",3,1));

		list.add(new Person("150105195406029018","19","19",1,1,1,"庞国斌","原",3,1));

		list.add(new Person("150102196405044027","19","19",1,1,1,"韩利霞","原",3,2));

		list.add(new Person("150102195112012510","19","19",1,1,1,"边树仁","原",3,1));

		list.add(new Person("150103196405090521","19","19",1,1,1,"徐秋菊","原",3,2));

		list.add(new Person("150104196406241025","19","19",1,1,1,"郑华","原",3,2));

		list.add(new Person("150103195406030518","19","19",1,1,1,"王凤鸣","原",3,1));

		list.add(new Person("150103195405021011","19","19",1,1,1,"杜武魁","原",3,1));

		list.add(new Person("150104195402250018","19","19",1,1,1,"薛奎","原",3,1));

		list.add(new Person("150104195401290114","19","19",1,1,1,"陈焕明","原",3,1));

		list.add(new Person("15010219521002403X","19","19",1,1,1,"张国信","原",3,1));

		list.add(new Person("150102196606280544","19","19",1,1,1,"李秀艳","原",3,2));

		list.add(new Person("150102196406104044","19","19",1,1,1,"孙霞","原",3,2));

		list.add(new Person("150103196404051029","19","19",1,1,1,"王翠苹","原",3,2));

		list.add(new Person("150105196406029020","19","19",1,1,1,"张彩清","原",3,2));

		list.add(new Person("150102196403241027","19","19",1,1,1,"杨彩惠","原",3,2));

		list.add(new Person("150102195406150011","19","19",1,1,1,"李国维","原",3,1));

		list.add(new Person("150103196403202024","19","19",1,1,1,"赵爱英","原",3,2));

		list.add(new Person("150102196403101526","19","19",1,1,1,"刘彩云","原",3,2));

		list.add(new Person("150104196402010529","19","19",1,1,1,"赵英","原",3,2));

		list.add(new Person("150104196402271526","19","19",1,1,1,"李彦平","原",3,2));

		list.add(new Person("15010319640114254X","19","19",1,1,1,"杨凤英","原",3,2));

		list.add(new Person("150104196404170040","19","19",1,1,1,"张瑾","原",3,2));

		list.add(new Person("150105196402049067","19","19",1,1,1,"王玉梅","原",3,2));

		list.add(new Person("150104196403021027","19","19",1,1,1,"王建平","原",3,2));

		list.add(new Person("150105195403269016","19","19",1,1,1,"付锡坤","原",3,1));

		list.add(new Person("150105195406019039","19","19",1,1,1,"赵七十一","原",3,1));

		list.add(new Person("150104196406200522","19","19",1,1,1,"梁俊萍","原",3,2));

		list.add(new Person("150102195411124053","19","19",1,1,1,"王玉斌","原",3,1));

		list.add(new Person("150103195406070536","19","19",1,1,1,"霍亚东","原",3,1));

		list.add(new Person("150103195403032518","19","19",1,1,1,"马清泉","原",3,1));

		list.add(new Person("150104195406212019","19","19",1,1,1,"蔡有新","原",3,1));

		list.add(new Person("150104196402040023","19","19",1,1,1,"马丽霞","原",3,2));

		list.add(new Person("150105196401170527","19","19",1,1,1,"张鱼鱼","原",3,2));

		list.add(new Person("150103195406111019","19","19",1,1,1,"王延林","原",3,1));

		list.add(new Person("150105195406059014","19","19",1,1,1,"张福存","原",3,1));

		list.add(new Person("150105196404159083","19","19",1,1,1,"董永凤","原",3,2));

		list.add(new Person("150102196401124062","19","19",1,1,1,"张素娥","原",3,2));

		list.add(new Person("150104196405130040","19","19",1,1,1,"姚光红","原",3,2));

		list.add(new Person("150103196704161027","19","19",1,1,1,"云懿珍","原",3,2));

		list.add(new Person("150102196403082046","19","19",1,1,1,"武国霞","原",3,2));

		list.add(new Person("150103196401290526","19","19",1,1,1,"贾凤英","原",3,2));

		list.add(new Person("150102196407012045","19","19",1,1,1,"王莉","原",3,2));

		list.add(new Person("150103196307071124","19","19",1,1,1,"青云","原",3,2));

		list.add(new Person("150104196407010026","19","19",1,1,1,"杨秀瑗","原",3,2));

		list.add(new Person("150104195906240534","19","19",1,1,1,"任吉祥","原",3,1));

		list.add(new Person("15010319650721154X","19","19",1,1,1,"温红梅","原",3,2));

		list.add(new Person("150105195408119017","19","19",1,1,1,"陈树西","原",3,1));

		list.add(new Person("150104196408252043","19","19",1,1,1,"杨茜","原",3,2));

		list.add(new Person("150102195408030531","19","19",1,1,1,"石和平","原",3,1));

		list.add(new Person("150104195508182017","19","19",1,1,1,"云长栓","原",3,1));

		list.add(new Person("150105195408210515","19","19",1,1,1,"范其其","原",3,1));

		list.add(new Person("150105196408144524","19","19",1,1,1,"赵小丽","原",3,2));

		list.add(new Person("150110196408294566","19","19",1,1,1,"李俊","原",3,2));

		list.add(new Person("150102196407122527","19","19",1,1,1,"魏剑虹","原",3,2));

		list.add(new Person("150102196510211528","19","19",1,1,1,"崔占涛","原",3,2));

		list.add(new Person("150102195109093014","19","19",1,1,1,"王二娃","原",3,1));

		list.add(new Person("150102196609010021","19","19",1,1,1,"丁晓英","原",3,2));

		list.add(new Person("150105196409028744","19","19",1,1,1,"曹布敦格日乐","原",3,2));

		list.add(new Person("150104196403080027","19","19",1,1,1,"辛红卫","原",3,2));

		list.add(new Person("152601196410041106","19","19",1,1,1,"石文英","原",3,2));

		list.add(new Person("152801196407053326","19","19",1,1,1,"翟慧清","原",3,2));

		list.add(new Person("15010419641013162X","19","19",1,1,1,"成艳勤","原",3,2));

		list.add(new Person("150104195406020519","19","19",1,1,1,"任兰锁","原",3,1));

		list.add(new Person("150105196406209021","19","19",1,1,1,"刘玉花","原",3,2));

		list.add(new Person("150103195405102516","19","19",1,1,1,"卢滨","原",3,1));

		list.add(new Person("222301196405241527","19","19",1,1,1,"金吉淑","原",3,2));

		list.add(new Person("150105195406199033","19","19",1,1,1,"陈喜明","原",3,1));

		list.add(new Person("150105196409239023","19","19",1,1,1,"张拉弟","原",3,2));

		list.add(new Person("150104195409191014","19","19",1,1,1,"马占发","原",3,1));

		list.add(new Person("150103195410201017","19","19",1,1,1,"马文超","原",3,1));

		list.add(new Person("150103195409261012","19","19",1,1,1,"石万才","原",3,1));

		list.add(new Person("150102196408114086","19","19",1,1,1,"陈玉珍","原",3,2));

		list.add(new Person("150121195907167726","19","19",1,1,1,"云金枝","原",3,2));

		list.add(new Person("150103195402111572","19","19",1,1,1,"吴金锁","原",3,1));

		list.add(new Person("150102196410310043","19","19",1,1,1,"李改清","原",3,2));

		list.add(new Person("150104196410240041","19","19",1,1,1,"阿荣","原",3,2));

		list.add(new Person("152221196711101620","19","19",1,1,1,"李俊英","原",3,2));

		list.add(new Person("15010219541001301X","19","19",1,1,1,"白孝民","原",3,1));

		list.add(new Person("15010419651010002X","19","19",1,1,1,"张建华","原",3,2));

		list.add(new Person("150102196402222027","19","19",1,1,1,"池燕","原",3,2));

		list.add(new Person("150104196711210524","19","19",1,1,1,"李美清","原",3,2));

		list.add(new Person("150102196410064065","19","19",1,1,1,"刘本琴","原",3,2));

		list.add(new Person("152223195411098317","19","19",1,1,1,"崔栓文","原",3,1));

		list.add(new Person("150103196909290623","19","19",1,1,1,"程少英","原",3,2));

		list.add(new Person("150104196707100023","19","19",1,1,1,"姜红","原",3,2));

		list.add(new Person("150104195511130015","19","19",1,1,1,"魏四召","原",3,1));

		list.add(new Person("150102196411051529","19","19",1,1,1,"郭巧英","原",3,2));

		list.add(new Person("150103196606201021","19","19",1,1,1,"高凤龙","原",3,2));


		list.add(new Person("150105196701040521","19","19",1,1,1,"银改桃","原",3,2));

		list.add(new Person("15010319641122002X","19","19",1,1,1,"张玲梅","原",3,2));

		list.add(new Person("150103196411100044","19","19",1,1,1,"张冬梅","原",3,2));

		list.add(new Person("150103195411270532","19","19",1,1,1,"张廷彪","原",3,1));

		list.add(new Person("150102196502224126","19","19",1,1,1,"白文泉","原",3,2));

		list.add(new Person("420122196409150549","19","19",1,1,1,"张燕","原",3,2));

		list.add(new Person("150103196411201064","19","19",1,1,1,"李金萍","原",3,2));

		list.add(new Person("150102195402141011","19","19",1,1,1,"冯来栓","原",3,1));

		list.add(new Person("150103196905041064","19","19",1,1,1,"齐淑芳","原",3,2));

		list.add(new Person("150105196209279020","19","19",1,1,1,"王桂梅","原",3,2));

		list.add(new Person("150103196212271027","19","19",1,1,1,"王红彦","原",3,2));

		list.add(new Person("15010519641221402X","19","19",1,1,1,"赵香连","原",3,2));

		list.add(new Person("150104195412231013","19","19",1,1,1,"陈建兴","原",3,1));

		list.add(new Person("150102195412272517","19","19",1,1,1,"贺富","原",3,1));

		list.add(new Person("15010219641215462X","19","19",1,1,1,"郭淑玲","原",3,2));

		list.add(new Person("150102195501200515","19","19",1,1,1,"安智勇","原",3,1));

		list.add(new Person("150103195501191010","19","19",1,1,1,"魏刚","原",3,1));

		list.add(new Person("150105196312180520","19","19",1,1,1,"范秀英","原",3,2));


		list.add(new Person("150105195501192518","19","19",1,1,1,"赵二有","原",3,1));

		list.add(new Person("150102196412220041","19","19",1,1,1,"赵翠英","原",3,2));

		list.add(new Person("150102196411284561","19","19",1,1,1,"晓燕","原",3,2));

		list.add(new Person("150104196501020546","19","19",1,1,1,"蔡春娥","原",3,2));

		list.add(new Person("150103196502151066","19","19",1,1,1,"陈美霞","原",3,2));

		list.add(new Person("150102196502151545","19","19",1,1,1,"赵凤娣","原",3,2));

		list.add(new Person("150105196401134024","19","19",1,1,1,"刘秀风","原",3,2));

		list.add(new Person("150105195503089012","19","19",1,1,1,"杜卫东","原",3,1));

		list.add(new Person("150102196501210523","19","19",1,1,1,"石利君","原",3,2));

		list.add(new Person("150104195503221611","19","19",1,1,1,"高二奎","原",3,1));

		list.add(new Person("150104196501040563","19","19",1,1,1,"狄冬梅","原",3,2));

		list.add(new Person("150102196506250516","19","19",1,1,1,"刘磊","原",3,1));

		list.add(new Person("150103195501282019","19","19",1,1,1,"李利柱","原",3,1));

		list.add(new Person("150103196501190565","19","19",1,1,1,"白慧玲","原",3,2));

		list.add(new Person("150104196502081527","19","19",1,1,1,"赵云风","原",3,2));

		list.add(new Person("150102196502240046","19","19",1,1,1,"宁学梅","原",3,2));

		list.add(new Person("150102195502251517","19","19",1,1,1,"李晋泰","原",3,1));

		list.add(new Person("150102195501011511","19","19",1,1,1,"武天祥","原",3,1));

		list.add(new Person("150105195410209011","19","19",1,1,1,"王月刚","原",3,1));

		list.add(new Person("150105196503129023","19","19",1,1,1,"李秀梅","原",3,2));

		list.add(new Person("150103196503291028","19","19",1,1,1,"李文娟","原",3,2));

		list.add(new Person("150105196503271521","19","19",1,1,1,"曹桂梅","原",3,2));

		list.add(new Person("150102195503190015","19","19",1,1,1,"雷雨晴","原",3,1));

		list.add(new Person("150103196501101040","19","19",1,1,1,"陈亚娜","原",3,2));

		list.add(new Person("150102195502143014","19","19",1,1,1,"赵锦忠","原",3,1));

		list.add(new Person("150103195601201511","19","19",1,1,1,"王根全","原",3,1));

		list.add(new Person("15010419550329153X","19","19",1,1,1,"王荣","原",3,1));

		list.add(new Person("150103195503071039","19","19",1,1,1,"郝建平","原",3,1));

		list.add(new Person("150105196412140569","19","19",1,1,1,"张改鲜","原",3,2));

		list.add(new Person("150103195503092518","19","19",1,1,1,"唐家舜","原",3,1));

		list.add(new Person("150103195503161018","19","19",1,1,1,"庞利","原",3,1));

		list.add(new Person("150102196402180023","19","19",1,1,1,"丁建荣","原",3,2));

		list.add(new Person("150102196503154027","19","19",1,1,1,"张艳萍","原",3,2));

		list.add(new Person("150104195501200032","19","19",1,1,1,"梁永禄","原",3,1));

		list.add(new Person("150102196503232080","19","19",1,1,1,"张美云","原",3,2));

		list.add(new Person("150102195502200058","19","19",1,1,1,"霍召风","原",3,1));

		list.add(new Person("15010419550130101X","19","19",1,1,1,"王富","原",3,1));

		list.add(new Person("15010219530207451X","19","19",1,1,1,"于文和","原",3,1));

		list.add(new Person("150102196502182528","19","19",1,1,1,"陈岩","原",3,2));

		list.add(new Person("150103195501012035","19","19",1,1,1,"于鸿达","原",3,1));

		list.add(new Person("150105195502160518","19","19",1,1,1,"孙石岺","原",3,1));

		list.add(new Person("150103196503100041","19","19",1,1,1,"吴瑞彩","原",3,2));

		list.add(new Person("150103196503202021","19","19",1,1,1,"尚春香","原",3,2));

		list.add(new Person("150102195502211515","19","19",1,1,1,"宋延浩","原",3,1));

		list.add(new Person("150104195502120018","19","19",1,1,1,"王祯","原",3,1));

		list.add(new Person("150102195502234012","19","19",1,1,1,"谢建设","原",3,1));

		list.add(new Person("150103195502060514","19","19",1,1,1,"栗仲平","原",3,1));

		list.add(new Person("150103196501191066","19","19",1,1,1,"李秀敏","原",3,2));

		list.add(new Person("15010419650305052X","19","19",1,1,1,"刘玉莲","原",3,2));

		list.add(new Person("150105196411280527","19","19",1,1,1,"冯彩虹","原",3,2));

		list.add(new Person("150104196503180041","19","19",1,1,1,"王成梅","原",3,2));

		list.add(new Person("150105195503011514","19","19",1,1,1,"石月恒","原",3,1));

		list.add(new Person("150102196501154082","19","19",1,1,1,"耿茂青","原",3,2));

		list.add(new Person("150102196503152523","19","19",1,1,1,"胡雁清","原",3,2));

		list.add(new Person("150103196502242021","19","19",1,1,1,"韩春梅","原",3,2));

		list.add(new Person("150103195502142018","19","19",1,1,1,"陈友忠","原",3,1));

		list.add(new Person("150104196503100021","19","19",1,1,1,"谷丽萍","原",3,2));

		list.add(new Person("150102195503040551","19","19",1,1,1,"张维惇","原",3,1));

		list.add(new Person("150103196502061028","19","19",1,1,1,"翟爱梅","原",3,2));

		list.add(new Person("150104195501250013","19","19",1,1,1,"樊和平","原",3,1));

		list.add(new Person("15010219660415152X","19","19",1,1,1,"翟秀梅","原",3,2));

		list.add(new Person("150103196501250046","19","19",1,1,1,"牛丽琴","原",3,2));

		list.add(new Person("150103196502200024","19","19",1,1,1,"杜丽平","原",3,2));

		list.add(new Person("15010219650308310X","19","19",1,1,1,"张丽梅","原",3,2));

		list.add(new Person("150104196503010042","19","19",1,1,1,"史荣梅","原",3,2));

		list.add(new Person("150102196503103529","19","19",1,1,1,"王晓红","原",3,2));

		list.add(new Person("150103196503191529","19","19",1,1,1,"富毅智","原",3,2));

		list.add(new Person("150105196503135511","19","19",1,1,1,"乔勇","原",3,1));

		list.add(new Person("150105195503110512","19","19",1,1,1,"宋国良","原",3,1));

		list.add(new Person("150102195505019050","19","19",1,1,1,"赵育恩","原",3,1));

		list.add(new Person("150105195501240516","19","19",1,1,1,"张志庚","原",3,1));

		list.add(new Person("150102196502082527","19","19",1,1,1,"温智芳","原",3,2));

		list.add(new Person("150104196503101526","19","19",1,1,1,"张淑兰","原",3,2));

		list.add(new Person("150102196502023041","19","19",1,1,1,"张晓玲","原",3,2));

		list.add(new Person("150102196501214049","19","19",1,1,1,"孙建兰","原",3,2));

		list.add(new Person("150103196501291024","19","19",1,1,1,"蒋平芝","原",3,2));

		list.add(new Person("150102196410071548","19","19",1,1,1,"翟世静","原",3,2));

		list.add(new Person("150105195501061518","19","19",1,1,1,"杨树拴","原",3,1));

		list.add(new Person("150103196503022020","19","19",1,1,1,"马建萍","原",3,2));

		list.add(new Person("150102196503062026","19","19",1,1,1,"闫美玲","原",3,2));

		list.add(new Person("150103195302100518","19","19",1,1,1,"段志刚","原",3,1));

		list.add(new Person("150104195503110014","19","19",1,1,1,"颜明智","原",3,1));

		list.add(new Person("150102196502084020","19","19",1,1,1,"周英莲","原",3,2));

		list.add(new Person("150104196501230527","19","19",1,1,1,"陈丽英","原",3,2));

		list.add(new Person("150102195409303511","19","19",1,1,1,"刘建平","原",3,1));

		list.add(new Person("150102195503292513","19","19",1,1,1,"杨洪勇","原",3,1));

		list.add(new Person("150102195503200551","19","19",1,1,1,"聂荣福","原",3,1));

		list.add(new Person("150104196503011045","19","19",1,1,1,"凌云","原",3,2));

		list.add(new Person("150102196501212107","19","19",1,1,1,"严淑珍","原",3,2));

		list.add(new Person("150103196502100066","19","19",1,1,1,"冯秀兰","原",3,2));

		list.add(new Person("150104196502190520","19","19",1,1,1,"郭月梅","原",3,2));

		list.add(new Person("150102196501060545","19","19",1,1,1,"高俊风","原",3,2));

		list.add(new Person("150103196502182022","19","19",1,1,1,"马春林","原",3,2));

		list.add(new Person("150103196502191025","19","19",1,1,1,"冯荣","原",3,2));

		list.add(new Person("150102196502091546","19","19",1,1,1,"耿继荣","原",3,2));

		list.add(new Person("150103196210014027","19","19",1,1,1,"范茹兰","原",3,2));

		list.add(new Person("15010419640319004X","19","19",1,1,1,"王慧玲","原",3,2));

		list.add(new Person("150105195503169039","19","19",1,1,1,"赵祯","原",3,1));

		list.add(new Person("150105196501137329","19","19",1,1,1,"孙丽文","原",3,2));

		list.add(new Person("150102195503013051","19","19",1,1,1,"史智明","原",3,1));

		list.add(new Person("150102196502233022","19","19",1,1,1,"王晓珏","原",3,2));

		list.add(new Person("150102195501034019","19","19",1,1,1,"潘保华","原",3,1));

		list.add(new Person("15010219640723254X","19","19",1,1,1,"孟春艳","原",3,2));

		list.add(new Person("150102196501284522","19","19",1,1,1,"郝景梅","原",3,2));

		list.add(new Person("150102195502151014","19","19",1,1,1,"张成俊","原",3,1));

		list.add(new Person("150102196207011021","19","19",1,1,1,"李洁","原",3,2));

		list.add(new Person("150104195502200018","19","19",1,1,1,"张岳来","原",3,1));

		list.add(new Person("150102196501050523","19","19",1,1,1,"王英梅","原",3,2));

		list.add(new Person("150102195503093514","19","19",1,1,1,"林涛","原",3,1));

		list.add(new Person("150103195503070538","19","19",1,1,1,"姚力","原",3,1));

		list.add(new Person("150102196502272566","19","19",1,1,1,"续丽霞","原",3,2));

		list.add(new Person("150105195408300510","19","19",1,1,1,"王昭柱","原",3,1));

		list.add(new Person("150104195501290015","19","19",1,1,1,"戴永胜","原",3,1));

		list.add(new Person("150103195501010531","19","19",1,1,1,"王忠","原",3,1));

		list.add(new Person("150103196502111603","19","19",1,1,1,"孙美华","原",3,2));

		list.add(new Person("150103196502140025","19","19",1,1,1,"宁玉玲","原",3,2));

		list.add(new Person("150104196504120526","19","19",1,1,1,"程延秋","原",3,2));

		list.add(new Person("150104195503230016","19","19",1,1,1,"董益民","原",3,1));

		list.add(new Person("150103196502112526","19","19",1,1,1,"杨东燕","原",3,2));

		list.add(new Person("150105196502257824","19","19",1,1,1,"王翠青","原",3,2));

		list.add(new Person("150102195503304510","19","19",1,1,1,"罗宁","原",3,1));

		list.add(new Person("150104196501240020","19","19",1,1,1,"徐芳","原",3,2));

		list.add(new Person("150102196503132549","19","19",1,1,1,"蔺光","原",3,2));

		list.add(new Person("150103196502121027","19","19",1,1,1,"李瑞梅","原",3,2));

		list.add(new Person("150104196502010585","19","19",1,1,1,"崔凤英","原",3,2));

		list.add(new Person("150102196503083062","19","19",1,1,1,"亢双萍","原",3,2));

		list.add(new Person("150103196502050062","19","19",1,1,1,"李春","原",3,2));

		list.add(new Person("15010219640929455X","19","19",1,1,1,"赵玉贵","原",3,1));

		list.add(new Person("150104196502190029","19","19",1,1,1,"杨春娣","原",3,2));

		list.add(new Person("150102196503162545","19","19",1,1,1,"晋灵娣","原",3,2));

		list.add(new Person("15263019650118186X","19","19",1,1,1,"吴冲","原",3,2));

		list.add(new Person("150104195503261517","19","19",1,1,1,"段建军","原",3,1));

		list.add(new Person("150105196502029047","19","19",1,1,1,"徐晓芝","原",3,2));

		list.add(new Person("150105195502282531","19","19",1,1,1,"秦锁锁","原",3,1));

		list.add(new Person("150102195612270516","19","19",1,1,1,"郎绥生","原",3,1));

		list.add(new Person("150103196503050523","19","19",1,1,1,"张秀芝","原",3,2));

		list.add(new Person("150104195503301013","19","19",1,1,1,"李建生","原",3,1));

		list.add(new Person("150102195411012019","19","19",1,1,1,"杜慧根","原",3,1));

		list.add(new Person("150102196502190026","19","19",1,1,1,"刘春勤","原",3,2));

		list.add(new Person("150102196503034025","19","19",1,1,1,"海宏","原",3,2));

		list.add(new Person("150102196502153049","19","19",1,1,1,"李金梅","原",3,2));

		list.add(new Person("150103196502041027","19","19",1,1,1,"崔佩玲","原",3,2));

		list.add(new Person("150104196502222027","19","19",1,1,1,"马丽萍","原",3,2));

		list.add(new Person("150103196602262062","19","19",1,1,1,"李晓春","原",3,2));

		list.add(new Person("150102195503264010","19","19",1,1,1,"秦洋洋","原",3,1));

		list.add(new Person("150102195502280510","19","19",1,1,1,"张贵元","原",3,1));

		list.add(new Person("150102196502050525","19","19",1,1,1,"封锦叶","原",3,2));

		list.add(new Person("15010419560115001X","19","19",1,1,1,"武恒魁","原",3,1));

		list.add(new Person("150104195501061511","19","19",1,1,1,"侯根全","原",3,1));

		list.add(new Person("150103196501241529","19","19",1,1,1,"刘玉华","原",3,2));

		list.add(new Person("152623195503260010","19","19",1,1,1,"侯和平","原",3,1));

		list.add(new Person("150102195602020513","19","19",1,1,1,"朱二勇","原",3,1));

		list.add(new Person("150103195402171057","19","19",1,1,1,"段宝文","原",3,1));

		list.add(new Person("150102196502060520","19","19",1,1,1,"石莲春","原",3,2));

		list.add(new Person("150105196506230522","19","19",1,1,1,"刘秀云","原",3,2));

		list.add(new Person("150103196504060029","19","19",1,1,1,"郑萍","原",3,2));

		list.add(new Person("150102196503083089","19","19",1,1,1,"亢美萍","原",3,2));

		list.add(new Person("150103195501151078","19","19",1,1,1,"李晗夫","原",3,1));

		list.add(new Person("150105196502017345","19","19",1,1,1,"闫雅珍","原",3,2));

		list.add(new Person("150103196503302049","19","19",1,1,1,"闫春梅","原",3,2));

		list.add(new Person("150102196502173023","19","19",1,1,1,"吴利萍","原",3,2));

		list.add(new Person("150103196501091022","19","19",1,1,1,"王淑芳","原",3,2));

		list.add(new Person("150102195502190013","19","19",1,1,1,"赵纪鸣","原",3,1));

		list.add(new Person("150102195502010035","19","19",1,1,1,"王耀","原",3,1));

		list.add(new Person("150102196502090025","19","19",1,1,1,"陈凤林","原",3,2));

		list.add(new Person("150103196503051024","19","19",1,1,1,"毕建华","原",3,2));

		list.add(new Person("15010419550321055X","19","19",1,1,1,"许连生","原",3,1));

		list.add(new Person("150103195501172514","19","19",1,1,1,"陈鹤利","原",3,1));

		list.add(new Person("150102196503252524","19","19",1,1,1,"孙丽珍","原",3,2));

		list.add(new Person("150105196501049046","19","19",1,1,1,"史云兰","原",3,2));

		list.add(new Person("15210119650206122X","19","19",1,1,1,"程嫣丽","原",3,2));

		list.add(new Person("150102195501111512","19","19",1,1,1,"乔耀中","原",3,1));

		list.add(new Person("150104196401013023","19","19",1,1,1,"王春梅","原",3,2));

		list.add(new Person("150104195502012033","19","19",1,1,1,"刘经世","原",3,1));

		list.add(new Person("150103195502140514","19","19",1,1,1,"胡林","原",3,1));

		list.add(new Person("150102195503301010","19","19",1,1,1,"马林","原",3,1));

		list.add(new Person("150104196503021024","19","19",1,1,1,"任香菊","原",3,2));

		list.add(new Person("150104196503061528","19","19",1,1,1,"邱云","原",3,2));

		list.add(new Person("150104196503131549","19","19",1,1,1,"胡利平","原",3,2));

		list.add(new Person("15010219631029404X","19","19",1,1,1,"袁俊梅","原",3,2));

		list.add(new Person("150102195503023532","19","19",1,1,1,"贾银兰","原",3,1));

		list.add(new Person("150104195503301515","19","19",1,1,1,"史国华","原",3,1));

		list.add(new Person("150103196501161027","19","19",1,1,1,"王四清","原",3,2));

		list.add(new Person("150103195412212019","19","19",1,1,1,"张聪元","原",3,1));

		list.add(new Person("150105196503111544","19","19",1,1,1,"张玉琴","原",3,2));

		list.add(new Person("150103196501270020","19","19",1,1,1,"王淑华","原",3,2));

		list.add(new Person("150105196502270527","19","19",1,1,1,"周峥","原",3,2));

		list.add(new Person("150103196501061528","19","19",1,1,1,"宋秀英","原",3,2));

		list.add(new Person("150103196502071023","19","19",1,1,1,"李平","原",3,2));

		list.add(new Person("150104196507260022","19","19",1,1,1,"王利华","原",3,2));

		list.add(new Person("150102195503232510","19","19",1,1,1,"唐根运","原",3,1));

		list.add(new Person("150104195502181531","19","19",1,1,1,"王金栋","原",3,1));

		list.add(new Person("150105196310030641","19","19",1,1,1,"韩玲秀","原",3,2));

		list.add(new Person("150102196502262085","19","19",1,1,1,"王艳平","原",3,2));

		list.add(new Person("150103196502262524","19","19",1,1,1,"刘桂英","原",3,2));

		list.add(new Person("15010319550211253X","19","19",1,1,1,"张海","原",3,1));

		list.add(new Person("150102195502032533","19","19",1,1,1,"巩社","原",3,1));

		list.add(new Person("150105196502150525","19","19",1,1,1,"岳志荣","原",3,2));

		list.add(new Person("150102196408144584","19","19",1,1,1,"林苑","原",3,2));

		list.add(new Person("150102195502194516","19","19",1,1,1,"蔡应节","原",3,1));

		list.add(new Person("150105195501252517","19","19",1,1,1,"智长后","原",3,1));

		list.add(new Person("150103196502090048","19","19",1,1,1,"王瑞云","原",3,2));

		list.add(new Person("150103196501211020","19","19",1,1,1,"潘永爱","原",3,2));

		list.add(new Person("150102196502044088","19","19",1,1,1,"赵引弟","原",3,2));

		list.add(new Person("150103195603193017","19","19",1,1,1,"王景明","原",3,1));

		list.add(new Person("150103196502221028","19","19",1,1,1,"王桂玲","原",3,2));

		list.add(new Person("150104195503130533","19","19",1,1,1,"张建峰","原",3,1));

		list.add(new Person("150102195503050530","19","19",1,1,1,"李志强","原",3,1));

		list.add(new Person("150105196503160522","19","19",1,1,1,"董莲梅","原",3,2));

		list.add(new Person("150103195501080011","19","19",1,1,1,"刘恒","原",3,1));

		list.add(new Person("150103195503011511","19","19",1,1,1,"李德怀","原",3,1));

		list.add(new Person("150105196211241523","19","19",1,1,1,"闫利珍","原",3,2));

		list.add(new Person("150104196502161025","19","19",1,1,1,"刘红年","原",3,2));

		list.add(new Person("150102196503231029","19","19",1,1,1,"杨万香","原",3,2));

		list.add(new Person("15010319690823104X","19","19",1,1,1,"宋英女","原",3,2));

		list.add(new Person("150102196501201520","19","19",1,1,1,"马桂香","原",3,2));

		list.add(new Person("150103196501011600","19","19",1,1,1,"马果珍","原",3,2));

		list.add(new Person("152621196503084426","19","19",1,1,1,"郝建秀","原",3,2));

		list.add(new Person("150104196501311028","19","19",1,1,1,"胡秀芬","原",3,2));

		list.add(new Person("150103196111301020","19","19",1,1,1,"殷利芳","原",3,2));

		list.add(new Person("150105196501059041","19","19",1,1,1,"徐云巧","原",3,2));

		list.add(new Person("150102196501202021","19","19",1,1,1,"王淑芬","原",3,2));

		list.add(new Person("150104195502050013","19","19",1,1,1,"宫喜喜","原",3,1));

		list.add(new Person("15010319650111102X","19","19",1,1,1,"郭娉","原",3,2));

		list.add(new Person("150104195501242013","19","19",1,1,1,"李福春","原",3,1));

		list.add(new Person("150103196503172061","19","19",1,1,1,"郭红荣","原",3,2));

		list.add(new Person("150105195503189013","19","19",1,1,1,"崔换锁","原",3,1));

		list.add(new Person("150104195502281639","19","19",1,1,1,"孙久红","原",3,1));

		list.add(new Person("150103195503142116","19","19",1,1,1,"常日青","原",3,1));

		list.add(new Person("150102195503193013","19","19",1,1,1,"傅维翰","原",3,1));

		list.add(new Person("150104195503240513","19","19",1,1,1,"王建华","原",3,1));

		list.add(new Person("150105196502069022","19","19",1,1,1,"刘金花","原",3,2));

		list.add(new Person("150104196502091020","19","19",1,1,1,"任改英","原",3,2));

		list.add(new Person("150104196501261024","19","19",1,1,1,"李静","原",3,2));

		list.add(new Person("150102196502272523","19","19",1,1,1,"吴秀玲","原",3,2));

		list.add(new Person("150102196503190044","19","19",1,1,1,"李玉萍","原",3,2));

		list.add(new Person("150104196308251510","19","19",1,1,1,"焦建祥","原",3,1));

		list.add(new Person("150104196502271021","19","19",1,1,1,"左莉萍","原",3,2));

		list.add(new Person("150103196005300032","19","19",1,1,1,"崔志强","原",3,1));

		list.add(new Person("15010319650204202X","19","19",1,1,1,"杨桂霞","原",3,2));

		list.add(new Person("150302196503130026","19","19",1,1,1,"薛梅","原",3,2));

		list.add(new Person("150105195501069018","19","19",1,1,1,"张诚","原",3,1));

		list.add(new Person("150102196412152560","19","19",1,1,1,"王芳","原",3,2));

		list.add(new Person("150104195502220019","19","19",1,1,1,"郭得山","原",3,1));

		list.add(new Person("150103196503201520","19","19",1,1,1,"刘殿霞","原",3,2));

		list.add(new Person("150102196501270040","19","19",1,1,1,"杨宏立","原",3,2));

		list.add(new Person("150103196401031022","19","19",1,1,1,"李艳民","原",3,2));

		list.add(new Person("150103195503152015","19","19",1,1,1,"柳珍堂","原",3,1));

		list.add(new Person("150103196503191027","19","19",1,1,1,"张瑞华","原",3,2));

		list.add(new Person("150102195503300018","19","19",1,1,1,"郭锡林","原",3,1));

		list.add(new Person("15010219541204053X","19","19",1,1,1,"兰国锋","原",3,1));

		list.add(new Person("152629196501080529","19","19",1,1,1,"贺培兰","原",3,2));

		list.add(new Person("15010419650225052X","19","19",1,1,1,"李秀芬","原",3,2));

		list.add(new Person("150102196410243047","19","19",1,1,1,"袁彩萍","原",3,2));

		list.add(new Person("150102196501120026","19","19",1,1,1,"李清","原",3,2));

		list.add(new Person("150102196502014524","19","19",1,1,1,"张春蕾","原",3,2));

		list.add(new Person("150102196503044565","19","19",1,1,1,"郝丽芬","原",3,2));

		list.add(new Person("150102196503263047","19","19",1,1,1,"张枝梅","原",3,2));

		list.add(new Person("150103195503131513","19","19",1,1,1,"王长林","原",3,1));

		list.add(new Person("150103196503250066","19","19",1,1,1,"郝成娥","原",3,2));

		list.add(new Person("150102196108011114","19","19",1,1,1,"赵兵","原",3,1));

		list.add(new Person("150103196503172045","19","19",1,1,1,"孙慧平","原",3,2));

		list.add(new Person("150102196501220043","19","19",1,1,1,"赵丽茹","原",3,2));

		list.add(new Person("15010519650301906X","19","19",1,1,1,"董林梅","原",3,2));

		list.add(new Person("150103196503051040","19","19",1,1,1,"陈茹","原",3,2));

		list.add(new Person("150103195502182511","19","19",1,1,1,"白维","原",3,1));

		list.add(new Person("150103195502162019","19","19",1,1,1,"杨铁栓","原",3,1));

		list.add(new Person("150103196503042128","19","19",1,1,1,"高丽茹","原",3,2));

		list.add(new Person("15010219660312452X","19","19",1,1,1,"张润利","原",3,2));

		list.add(new Person("150104195412020013","19","19",1,1,1,"贾玉成","原",3,1));

		list.add(new Person("150102196502274545","19","19",1,1,1,"闫兰芝","原",3,2));

		list.add(new Person("150102195503204536","19","19",1,1,1,"温志华","原",3,1));

		list.add(new Person("150104195502061513","19","19",1,1,1,"李秀岷","原",3,1));

		list.add(new Person("150104195501270014","19","19",1,1,1,"陈宝志","原",3,1));

		list.add(new Person("150104195503242017","19","19",1,1,1,"王志","原",3,1));

		list.add(new Person("150103196503161020","19","19",1,1,1,"张建梅","原",3,2));

		list.add(new Person("150104196701103020","19","19",1,1,1,"张素琴","原",3,2));

		list.add(new Person("150102195412152515","19","19",1,1,1,"阿木古隆","原",3,1));

		list.add(new Person("150104196503181028","19","19",1,1,1,"杨志峰","原",3,2));

		list.add(new Person("150103196501222029","19","19",1,1,1,"亢淑珍","原",3,2));

		list.add(new Person("150104196503150029","19","19",1,1,1,"陈玉琴","原",3,2));

		list.add(new Person("150104195911012034","19","19",1,1,1,"姚兰珠","原",3,1));

		list.add(new Person("150103196503121045","19","19",1,1,1,"刘春兰","原",3,2));

		list.add(new Person("150105196502089023","19","19",1,1,1,"孔平钢","原",3,2));

		list.add(new Person("150102196503284024","19","19",1,1,1,"康素萍","原",3,2));

		list.add(new Person("150104196502220021","19","19",1,1,1,"付金枝","原",3,2));

		list.add(new Person("150103196502172027","19","19",1,1,1,"杨玉英","原",3,2));

		list.add(new Person("150104196404200027","19","19",1,1,1,"高兰天","原",3,2));

		list.add(new Person("150104196503202044","19","19",1,1,1,"闫红","原",3,2));

		list.add(new Person("150102196502172522","19","19",1,1,1,"江文杰","原",3,2));

		list.add(new Person("150103196403261024","19","19",1,1,1,"郭红丽","原",3,2));

		list.add(new Person("150103196502210521","19","19",1,1,1,"代淑英","原",3,2));

		list.add(new Person("150104195502031015","19","19",1,1,1,"张忠厚","原",3,1));

		list.add(new Person("150102195501192535","19","19",1,1,1,"郭喜顺","原",3,1));

		list.add(new Person("150102196503034527","19","19",1,1,1,"成建停","原",3,2));

		list.add(new Person("15010319650222152X","19","19",1,1,1,"陈丽萍","原",3,2));

		list.add(new Person("150104195502121010","19","19",1,1,1,"王佩","原",3,1));

		list.add(new Person("15010219550221453X","19","19",1,1,1,"常明亮","原",3,1));

		list.add(new Person("150102195503294519","19","19",1,1,1,"王永进","原",3,1));

		list.add(new Person("150103196501242046","19","19",1,1,1,"赵未兰","原",3,2));

		list.add(new Person("150102195603231515","19","19",1,1,1,"张秀全","原",3,1));

		list.add(new Person("150105196502261022","19","19",1,1,1,"李爱荣","原",3,2));

		list.add(new Person("150102196501294528","19","19",1,1,1,"陈旭盈","原",3,2));

		list.add(new Person("150102196502072521","19","19",1,1,1,"强俊清","原",3,2));

		list.add(new Person("150103195503181019","19","19",1,1,1,"杨静杰","原",3,1));

		list.add(new Person("150104195502081514","19","19",1,1,1,"闫云","原",3,1));

		list.add(new Person("150102196502212520","19","19",1,1,1,"云淑琴","原",3,2));

		list.add(new Person("150105196501049089","19","19",1,1,1,"高俊英","原",3,2));

		list.add(new Person("150105195502169010","19","19",1,1,1,"卜宏旺","原",3,1));

		list.add(new Person("150102196501243528","19","19",1,1,1,"张喆","原",3,2));

		list.add(new Person("150104195502082015","19","19",1,1,1,"刘亭柱","原",3,1));

		list.add(new Person("150103196503191561","19","19",1,1,1,"刘艳萍","原",3,2));

		list.add(new Person("150103195501071051","19","19",1,1,1,"王玉起","原",3,1));

		list.add(new Person("150105196501269022","19","19",1,1,1,"施金平","原",3,2));

		list.add(new Person("150103195503252016","19","19",1,1,1,"张凯荣","原",3,1));

		list.add(new Person("150103195501041012","19","19",1,1,1,"贺秉义","原",3,1));

		list.add(new Person("150104195501271519","19","19",1,1,1,"闫利平","原",3,1));

		list.add(new Person("150102195503052552","19","19",1,1,1,"费世云","原",3,1));

		list.add(new Person("150104196501061129","19","19",1,1,1,"闫三女","原",3,2));

		list.add(new Person("150105195503060017","19","19",1,1,1,"付保林","原",3,1));

		list.add(new Person("150102196503162561","19","19",1,1,1,"图雅","原",3,2));

		list.add(new Person("150102196404112024","19","19",1,1,1,"王春枝","原",3,2));

		list.add(new Person("150103195502031035","19","19",1,1,1,"周锦明","原",3,1));

		list.add(new Person("150104195501010554","19","19",1,1,1,"苏龙","原",3,1));

		list.add(new Person("150102195502132534","19","19",1,1,1,"赵和平","原",3,1));

		list.add(new Person("150103196503122021","19","19",1,1,1,"刘改俊","原",3,2));

		list.add(new Person("150102196501271529","19","19",1,1,1,"刘艳玲","原",3,2));

		list.add(new Person("150104196501260048","19","19",1,1,1,"孙鲜花","原",3,2));

		list.add(new Person("150103196502201529","19","19",1,1,1,"刘墨秀","原",3,2));

		list.add(new Person("150104195501250515","19","19",1,1,1,"杜福根","原",3,1));

		list.add(new Person("150102196404024024","19","19",1,1,1,"李红雁","原",3,2));

		list.add(new Person("150103196502140527","19","19",1,1,1,"石月仙","原",3,2));

		list.add(new Person("150103196403031528","19","19",1,1,1,"李中华","原",3,2));

		list.add(new Person("150102196501272521","19","19",1,1,1,"李雅丽","原",3,2));

		list.add(new Person("150104195501231015","19","19",1,1,1,"李向成","原",3,1));

		list.add(new Person("150104196503040540","19","19",1,1,1,"刘瑞珍","原",3,2));

		list.add(new Person("150104196503310029","19","19",1,1,1,"杨萍","原",3,2));

		list.add(new Person("150102196603042022","19","19",1,1,1,"智美英","原",3,2));

		list.add(new Person("150102196502020027","19","19",1,1,1,"任红宇","原",3,2));

		list.add(new Person("150102195507120014","19","19",1,1,1,"曹浩景","原",3,1));

		list.add(new Person("150104195501200016","19","19",1,1,1,"张玉柱","原",3,1));

		list.add(new Person("150102195503093530","19","19",1,1,1,"王立平","原",3,1));

		list.add(new Person("150102196501290025","19","19",1,1,1,"其木格","原",3,2));

		list.add(new Person("150102196501202080","19","19",1,1,1,"赵怡双","原",3,2));

		list.add(new Person("15010219650319052X","19","19",1,1,1,"乌兰托娅","原",3,2));

		list.add(new Person("150104196503151021","19","19",1,1,1,"张丽琴","原",3,2));

		list.add(new Person("150105195501210536","19","19",1,1,1,"王业起","原",3,1));

		list.add(new Person("150105195502180519","19","19",1,1,1,"田栓造","原",3,1));

		list.add(new Person("150102195503074516","19","19",1,1,1,"栗卯文","原",3,1));

		list.add(new Person("150103196501031521","19","19",1,1,1,"朱玉凤","原",3,2));

		list.add(new Person("150102195501203011","19","19",1,1,1,"刘和平","原",3,1));

		list.add(new Person("150103195502212012","19","19",1,1,1,"陈富","原",3,1));

		list.add(new Person("150104195601110616","19","19",1,1,1,"陈拴柱","原",3,1));

		list.add(new Person("150104196504221626","19","19",1,1,1,"冯秀莲","原",3,2));

		list.add(new Person("150104196504241627","19","19",1,1,1,"王英","原",3,2));

		list.add(new Person("150103196504082025","19","19",1,1,1,"马福玲","原",3,2));

		list.add(new Person("150103195504192019","19","19",1,1,1,"薛勤","原",3,1));

		list.add(new Person("150104195504280015","19","19",1,1,1,"潘昕光","原",3,1));

		list.add(new Person("150102195504181532","19","19",1,1,1,"吴亚非","原",3,1));

		list.add(new Person("150105196501184520","19","19",1,1,1,"张雪芳","原",3,2));

		list.add(new Person("150102195504290018","19","19",1,1,1,"崔建国","原",3,1));

		list.add(new Person("150102195504140036","19","19",1,1,1,"兰全明","原",3,1));

		list.add(new Person("150104195501170013","19","19",1,1,1,"陈同平","原",3,1));

		list.add(new Person("150102196504162061","19","19",1,1,1,"米燕华","原",3,2));

		list.add(new Person("150103196501182127","19","19",1,1,1,"刘艳苓","原",3,2));

		list.add(new Person("150102196504170029","19","19",1,1,1,"贾美琴","原",3,2));

		list.add(new Person("150105195504031517","19","19",1,1,1,"王全乐","原",3,1));

		list.add(new Person("150102195504082016","19","19",1,1,1,"郭宪祥","原",3,1));

		list.add(new Person("150103196504222542","19","19",1,1,1,"武惠琴","原",3,2));

		list.add(new Person("150102196511144523","19","19",1,1,1,"包秀玲","原",3,2));

		list.add(new Person("15010219650403406X","19","19",1,1,1,"任亚妍","原",3,2));

		list.add(new Person("150104196504080544","19","19",1,1,1,"王春华","原",3,2));

		list.add(new Person("150303195503170011","19","19",1,1,1,"李轶","原",3,1));

		list.add(new Person("150102195504294019","19","19",1,1,1,"孙国昌","原",3,1));

		list.add(new Person("15010219550420401X","19","19",1,1,1,"冯军","原",3,1));

		list.add(new Person("150104196504110520","19","19",1,1,1,"包清华","原",3,2));

		list.add(new Person("150103196504170025","19","19",1,1,1,"马玉柱","原",3,2));

		list.add(new Person("150103195504290014","19","19",1,1,1,"高和平","原",3,1));

		list.add(new Person("150105196504299104","19","19",1,1,1,"张美芳","原",3,2));

		list.add(new Person("150103195501081014","19","19",1,1,1,"于春德","原",3,1));

		list.add(new Person("150102195502030538","19","19",1,1,1,"刘雅权","原",3,1));

		list.add(new Person("150121196504202421","19","19",1,1,1,"谭改秀","原",3,2));

		list.add(new Person("150104195504010015","19","19",1,1,1,"曹梦林","原",3,1));

		list.add(new Person("150103196410282544","19","19",1,1,1,"吴丽霞","原",3,2));

		list.add(new Person("150105195504219018","19","19",1,1,1,"李振生","原",3,1));

		list.add(new Person("150102196504022085","19","19",1,1,1,"薛瑞洪","原",3,2));

		list.add(new Person("15010219550326001X","19","19",1,1,1,"郭申礼","原",3,1));

		list.add(new Person("150104195503250017","19","19",1,1,1,"郭福生","原",3,1));

		list.add(new Person("150102196504060524","19","19",1,1,1,"高桂芳","原",3,2));

		list.add(new Person("150102196504014528","19","19",1,1,1,"杨静","原",3,2));

		list.add(new Person("150103196504010523","19","19",1,1,1,"王萍","原",3,2));

		list.add(new Person("150105196504029024","19","19",1,1,1,"李仙梅","原",3,2));

		list.add(new Person("150102195504220511","19","19",1,1,1,"赵栓明","原",3,1));

		list.add(new Person("15010419650428108X","19","19",1,1,1,"朱国艳","原",3,2));

		list.add(new Person("15010519550128501X","19","19",1,1,1,"崔和平","原",3,1));

		list.add(new Person("150104195504020010","19","19",1,1,1,"盛和锁","原",3,1));

		list.add(new Person("15010219590408052X","19","19",1,1,1,"田春敏","原",3,2));

		list.add(new Person("150102195503271034","19","19",1,1,1,"付贵","原",3,1));

		list.add(new Person("150102196504011028","19","19",1,1,1,"田慧芳","原",3,2));

		list.add(new Person("150104195504081534","19","19",1,1,1,"吴铜城","原",3,1));

		list.add(new Person("150103195504021017","19","19",1,1,1,"高步云","原",3,1));

		list.add(new Person("150104196504171024","19","19",1,1,1,"李彩英","原",3,2));

		list.add(new Person("150104196503232024","19","19",1,1,1,"曹月仙","原",3,2));

		list.add(new Person("150102196504050545","19","19",1,1,1,"李青燕","原",3,2));

		list.add(new Person("150103196504030065","19","19",1,1,1,"庞丽君","原",3,2));

		list.add(new Person("150102196504194020","19","19",1,1,1,"张静兰","原",3,2));

		list.add(new Person("150102196504162547","19","19",1,1,1,"王莉","原",3,2));

		list.add(new Person("150103196504262528","19","19",1,1,1,"郭美荣","原",3,2));

		list.add(new Person("150103196502211540","19","19",1,1,1,"朱兰香","原",3,2));

		list.add(new Person("150102195504100018","19","19",1,1,1,"季宪忠","原",3,1));

		list.add(new Person("150102196501192521","19","19",1,1,1,"唐金丽","原",3,2));

		list.add(new Person("15010319550114103X","19","19",1,1,1,"隋军","原",3,1));

		list.add(new Person("150102196504034529","19","19",1,1,1,"姜春英","原",3,2));

		list.add(new Person("150103195502151010","19","19",1,1,1,"牛托平","原",3,1));

		list.add(new Person("15010419550404053X","19","19",1,1,1,"柳贵民","原",3,1));

		list.add(new Person("150103195504051013","19","19",1,1,1,"阮天福","原",3,1));

		list.add(new Person("150102195503301512","19","19",1,1,1,"兰瑞林","原",3,1));

		list.add(new Person("150105195504030012","19","19",1,1,1,"董四四","原",3,1));

		list.add(new Person("150103196502220527","19","19",1,1,1,"王志华","原",3,2));

		list.add(new Person("150102196504021621","19","19",1,1,1,"刘俊霞","原",3,2));

		list.add(new Person("150102196501252547","19","19",1,1,1,"陈慧荣","原",3,2));

		list.add(new Person("150103195504210539","19","19",1,1,1,"张建忠","原",3,1));

		list.add(new Person("150103196504202023","19","19",1,1,1,"白彩云","原",3,2));

		list.add(new Person("150105196504129084","19","19",1,1,1,"赵秀枝","原",3,2));

		list.add(new Person("152623195402014697","19","19",1,1,1,"燕天艮","原",3,1));

		list.add(new Person("152701195501290918","19","19",1,1,1,"胜革","原",3,1));

		list.add(new Person("150104196501040547","19","19",1,1,1,"李艳青","原",3,2));

		list.add(new Person("150104195503011016","19","19",1,1,1,"李新生","原",3,1));

		list.add(new Person("150103195308010011","19","19",1,1,1,"王文瑞","原",3,1));

		list.add(new Person("150103196504061048","19","19",1,1,1,"马荣梅","原",3,2));

		list.add(new Person("150104196504250523","19","19",1,1,1,"裴永红","原",3,2));

		list.add(new Person("150104195502221038","19","19",1,1,1,"郭玉","原",3,1));

		list.add(new Person("150102196501272548","19","19",1,1,1,"李晓怡","原",3,2));

		list.add(new Person("150103195504251031","19","19",1,1,1,"刘克立","原",3,1));

		list.add(new Person("150102196504133025","19","19",1,1,1,"安秀荣","原",3,2));

		list.add(new Person("150104195504170510","19","19",1,1,1,"孟繁利","原",3,1));

		list.add(new Person("150102196504201569","19","19",1,1,1,"郭凤枝","原",3,2));

		list.add(new Person("150103196504060520","19","19",1,1,1,"彭俊梅","原",3,2));

		list.add(new Person("150102196504214546","19","19",1,1,1,"夏梅","原",3,2));

		list.add(new Person("150102196503252049","19","19",1,1,1,"赵金花","原",3,2));

		list.add(new Person("150122196504254527","19","19",1,1,1,"岳耀先","原",3,2));

		list.add(new Person("150104196412191626","19","19",1,1,1,"史俊峰","原",3,2));

		list.add(new Person("150104196502090546","19","19",1,1,1,"崔桂萍","原",3,2));

		list.add(new Person("150102195504271511","19","19",1,1,1,"马志云","原",3,1));

		list.add(new Person("150103196501152040","19","19",1,1,1,"贾爱荣","原",3,2));

		list.add(new Person("150102196504050027","19","19",1,1,1,"王世爱","原",3,2));

		list.add(new Person("150103195501222518","19","19",1,1,1,"吕有明","原",3,1));

		list.add(new Person("150104196501300521","19","19",1,1,1,"董晓玲","原",3,2));

		list.add(new Person("150104196504111021","19","19",1,1,1,"云志芳","原",3,2));

		list.add(new Person("150105196504044523","19","19",1,1,1,"王永梅","原",3,2));

		list.add(new Person("150102195504100077","19","19",1,1,1,"姚福成","原",3,1));

		list.add(new Person("150104195504090537","19","19",1,1,1,"张瑞","原",3,1));

		list.add(new Person("150102195504081515","19","19",1,1,1,"郭沙汀","原",3,1));

		list.add(new Person("150103196409280023","19","19",1,1,1,"杨淑琴","原",3,2));

		list.add(new Person("150102196504221527","19","19",1,1,1,"张素青","原",3,2));

		list.add(new Person("15010319650325004X","19","19",1,1,1,"刘润花","原",3,2));

		list.add(new Person("150104195604050014","19","19",1,1,1,"苏天平","原",3,1));

		list.add(new Person("150102196504130027","19","19",1,1,1,"王金花","原",3,2));

		list.add(new Person("150102196504201542","19","19",1,1,1,"孙秀英","原",3,2));

		list.add(new Person("150102195501032515","19","19",1,1,1,"王崇伟","原",3,1));

		list.add(new Person("150102195504051535","19","19",1,1,1,"刘礼","原",3,1));

		list.add(new Person("15010419650405002X","19","19",1,1,1,"李莎","原",3,2));

		list.add(new Person("150102195501144533","19","19",1,1,1,"贾贵军","原",3,1));

		list.add(new Person("150103196504092522","19","19",1,1,1,"雷霞","原",3,2));

		list.add(new Person("150102196504164024","19","19",1,1,1,"王金梅","原",3,2));

		list.add(new Person("150102195504292515","19","19",1,1,1,"姜保平","原",3,1));

		list.add(new Person("150104195503300512","19","19",1,1,1,"杜长春","原",3,1));

		list.add(new Person("150102196505253520","19","19",1,1,1,"云彩凤","原",3,2));

		list.add(new Person("15010319650317004X","19","19",1,1,1,"岳淑蓉","原",3,2));

		list.add(new Person("150104195803100512","19","19",1,1,1,"黄卫青","原",3,1));

		list.add(new Person("150104195503190034","19","19",1,1,1,"张禄","原",3,1));

		list.add(new Person("150102196501140625","19","19",1,1,1,"于改兰","原",3,2));

		list.add(new Person("150103195504261010","19","19",1,1,1,"商风翔","原",3,1));

		list.add(new Person("150105196504028523","19","19",1,1,1,"李文霞","原",3,2));

		list.add(new Person("150103196504061021","19","19",1,1,1,"徐国清","原",3,2));

		list.add(new Person("150103196502250048","19","19",1,1,1,"徐秀琴","原",3,2));

		list.add(new Person("150103195510211036","19","19",1,1,1,"段和平","原",3,1));

		list.add(new Person("150103196503041088","19","19",1,1,1,"张慧兰","原",3,2));

		list.add(new Person("150102196504134060","19","19",1,1,1,"王淑珍","原",3,2));

		list.add(new Person("150103196503082023","19","19",1,1,1,"齐兰芬","原",3,2));

		list.add(new Person("150103196504263029","19","19",1,1,1,"李彩霞","原",3,2));

		list.add(new Person("150104196504200024","19","19",1,1,1,"冯改莲","原",3,2));

		list.add(new Person("150103196504222526","19","19",1,1,1,"景晓玉","原",3,2));

		list.add(new Person("150104196501282028","19","19",1,1,1,"温培静","原",3,2));

		list.add(new Person("150102196504084024","19","19",1,1,1,"孙昀立","原",3,2));

		list.add(new Person("150105196503180523","19","19",1,1,1,"张灵仙","原",3,2));

		list.add(new Person("150102196501254024","19","19",1,1,1,"陈迎春","原",3,2));

		list.add(new Person("150102195401191017","19","19",1,1,1,"赵积明","原",3,1));

		list.add(new Person("150102196501112528","19","19",1,1,1,"郭兰梅","原",3,2));

		list.add(new Person("150103196501310029","19","19",1,1,1,"温美兰","原",3,2));

		list.add(new Person("150102196411150045","19","19",1,1,1,"赵红雷","原",3,2));

		list.add(new Person("150102195504102515","19","19",1,1,1,"徐亮","原",3,1));

		list.add(new Person("150104196304130025","19","19",1,1,1,"董爱萍","原",3,2));

		list.add(new Person("150104196503262020","19","19",1,1,1,"张文枝","原",3,2));

		list.add(new Person("150104196504230047","19","19",1,1,1,"孙桂霞","原",3,2));

		list.add(new Person("150104195504210519","19","19",1,1,1,"孙能贵","原",3,1));

		list.add(new Person("150102195504080010","19","19",1,1,1,"白世新","原",3,1));

		list.add(new Person("150102196404084086","19","19",1,1,1,"李美英","原",3,2));

		list.add(new Person("150105196402209067","19","19",1,1,1,"王仙琴","原",3,2));

		list.add(new Person("150104196502191021","19","19",1,1,1,"张瑞玲","原",3,2));

		list.add(new Person("150104195504130519","19","19",1,1,1,"寇小起","原",3,1));

		list.add(new Person("150102196503244524","19","19",1,1,1,"彭建英","原",3,2));

		list.add(new Person("150104195503111519","19","19",1,1,1,"武润喜","原",3,1));

		list.add(new Person("150102196502080521","19","19",1,1,1,"谢永红","原",3,2));

		list.add(new Person("150103195801211538","19","19",1,1,1,"朱成惠","原",3,1));

		list.add(new Person("150102196503011528","19","19",1,1,1,"白君丽","原",3,2));

		list.add(new Person("150105196502230525","19","19",1,1,1,"杨朝丽","原",3,2));

		list.add(new Person("150103196504281040","19","19",1,1,1,"苗春花","原",3,2));

		list.add(new Person("150103196503211526","19","19",1,1,1,"赵小兰","原",3,2));

		list.add(new Person("150102195504144539","19","19",1,1,1,"额尔敦桑","原",3,1));

		list.add(new Person("150105195503108711","19","19",1,1,1,"张驰","原",3,1));

		list.add(new Person("150104195503300010","19","19",1,1,1,"宋锁柱","原",3,1));

		list.add(new Person("150104195503050015","19","19",1,1,1,"张胜利","原",3,1));

		list.add(new Person("150102195502060518","19","19",1,1,1,"邓守城","原",3,1));

		list.add(new Person("150102196504185028","19","19",1,1,1,"弓晴岚","原",3,2));

		list.add(new Person("150103196501291067","19","19",1,1,1,"王晨梅","原",3,2));

		list.add(new Person("150103195504151014","19","19",1,1,1,"张志泉","原",3,1));

		list.add(new Person("150103195502031019","19","19",1,1,1,"李秉俊","原",3,1));

		list.add(new Person("150104195502180539","19","19",1,1,1,"赵新民","原",3,1));

		list.add(new Person("150102196503303520","19","19",1,1,1,"张伟岚","原",3,2));

		list.add(new Person("150104195501110512","19","19",1,1,1,"王春和","原",3,1));

		list.add(new Person("150203196504303081","19","19",1,1,1,"刘玲华","原",3,2));

		list.add(new Person("15010519550430903X","19","19",1,1,1,"马润蛇","原",3,1));

		list.add(new Person("150104196504170523","19","19",1,1,1,"焦玉萍","原",3,2));

		list.add(new Person("15010219650408004X","19","19",1,1,1,"郭艳英","原",3,2));

		list.add(new Person("150104195502120034","19","19",1,1,1,"张春清","原",3,1));

		list.add(new Person("150104195501191017","19","19",1,1,1,"李建伟","原",3,1));

		list.add(new Person("15010519550129053X","19","19",1,1,1,"云常祥","原",3,1));

		list.add(new Person("150103195504111012","19","19",1,1,1,"郝春风","原",3,1));

		list.add(new Person("150102196504253043","19","19",1,1,1,"王丽平","原",3,2));

		list.add(new Person("150104196504200526","19","19",1,1,1,"刘宝兰","原",3,2));

		list.add(new Person("152629196501015620","19","19",1,1,1,"赵凤英","原",3,2));

		list.add(new Person("150102196504182046","19","19",1,1,1,"赵桂莲","原",3,2));

		list.add(new Person("150102195504172011","19","19",1,1,1,"杨文华","原",3,1));

		list.add(new Person("150104195504030518","19","19",1,1,1,"李新志","原",3,1));

		list.add(new Person("150102195502164018","19","19",1,1,1,"吴继贤","原",3,1));

		list.add(new Person("150102196504010543","19","19",1,1,1,"吕新华","原",3,2));

		list.add(new Person("150103196503270024","19","19",1,1,1,"石绥萍","原",3,2));

		list.add(new Person("150102195509132510","19","19",1,1,1,"陈荣初","原",3,1));

		list.add(new Person("150104195502201010","19","19",1,1,1,"史永光","原",3,1));

		list.add(new Person("150104195501081010","19","19",1,1,1,"刘利民","原",3,1));

		list.add(new Person("15010219650119210X","19","19",1,1,1,"孙秀玲","原",3,2));

		list.add(new Person("15010519650222052X","19","19",1,1,1,"刘丽清","原",3,2));

		list.add(new Person("150104195501062012","19","19",1,1,1,"郭秉银","原",3,1));

		list.add(new Person("150102196504114529","19","19",1,1,1,"王凤仙","原",3,2));

		list.add(new Person("150103195503051513","19","19",1,1,1,"赵耕","原",3,1));

		list.add(new Person("152326196503270048","19","19",1,1,1,"孙艳芝","原",3,2));

		list.add(new Person("150103195504112031","19","19",1,1,1,"王新民","原",3,1));

		list.add(new Person("150103195503281036","19","19",1,1,1,"徐树华","原",3,1));

		list.add(new Person("150105195501279015","19","19",1,1,1,"王世杰","原",3,1));

		list.add(new Person("150103196510281020","19","19",1,1,1,"孙玉兰","原",3,2));

		list.add(new Person("150102196504202086","19","19",1,1,1,"全蔓华","原",3,2));

		list.add(new Person("150103196502142522","19","19",1,1,1,"王玲梅","原",3,2));

		list.add(new Person("150104196503011520","19","19",1,1,1,"郭晓雁","原",3,2));

		list.add(new Person("150103196501052525","19","19",1,1,1,"吴迎新","原",3,2));

		list.add(new Person("150102195512300554","19","19",1,1,1,"秦维平","原",3,1));

		list.add(new Person("150102195408161013","19","19",1,1,1,"于锡九","原",3,1));

		list.add(new Person("15012119650211812X","19","19",1,1,1,"柴红梅","原",3,2));

		list.add(new Person("150105196201039022","19","19",1,1,1,"贾俊莲","原",3,2));

		list.add(new Person("150102196503180022","19","19",1,1,1,"云桂仙","原",3,2));

		list.add(new Person("370124196503203027","19","19",1,1,1,"陈宽芝","原",3,2));

		list.add(new Person("150105196504129068","19","19",1,1,1,"李玉兰","原",3,2));

		list.add(new Person("150102195503023516","19","19",1,1,1,"李建国","原",3,1));

		list.add(new Person("150103195502020539","19","19",1,1,1,"韩全忠","原",3,1));

		list.add(new Person("150103196503151527","19","19",1,1,1,"郭艳红","原",3,2));

		list.add(new Person("15010319650407202X","19","19",1,1,1,"徐润香","原",3,2));

		list.add(new Person("150102196504300022","19","19",1,1,1,"刘艺娟","原",3,2));

		list.add(new Person("150103195503252518","19","19",1,1,1,"于世维","原",3,1));

		list.add(new Person("150103196501112065","19","19",1,1,1,"姚丙华","原",3,2));

		list.add(new Person("150104195503131034","19","19",1,1,1,"刘福威","原",3,1));

		list.add(new Person("15010519650318054X","19","19",1,1,1,"张艳梅","原",3,2));

		list.add(new Person("150102196504195023","19","19",1,1,1,"孙素芳","原",3,2));

		list.add(new Person("150104195501060017","19","19",1,1,1,"殷和平","原",3,1));

		list.add(new Person("15012119650429192X","19","19",1,1,1,"张美林","原",3,2));

		list.add(new Person("15010319650402102X","19","19",1,1,1,"柴静波","原",3,2));

		list.add(new Person("150104195504060514","19","19",1,1,1,"樊连根","原",3,1));

		list.add(new Person("150102195502220016","19","19",1,1,1,"牛建绥","原",3,1));

		list.add(new Person("150103196503182526","19","19",1,1,1,"刘锦花","原",3,2));

		list.add(new Person("150103196504092549","19","19",1,1,1,"马莉","原",3,2));

		list.add(new Person("150103196501192026","19","19",1,1,1,"杜艳花","原",3,2));

		list.add(new Person("150102196504122529","19","19",1,1,1,"张巧兰","原",3,2));

		list.add(new Person("150102196504202529","19","19",1,1,1,"王春萍","原",3,2));

		list.add(new Person("150102195504154016","19","19",1,1,1,"康成宝","原",3,1));

		list.add(new Person("150105195504149013","19","19",1,1,1,"高锁锁","原",3,1));

		list.add(new Person("150104196504090021","19","19",1,1,1,"穆红桃","原",3,2));

		list.add(new Person("150103195412191019","19","19",1,1,1,"李喜安","原",3,1));

		list.add(new Person("150105196504109024","19","19",1,1,1,"龚四清","原",3,2));

		list.add(new Person("15010219550418301X","19","19",1,1,1,"王生枝","原",3,1));

		list.add(new Person("150103196502221044","19","19",1,1,1,"刘凤娥","原",3,2));

		list.add(new Person("150102196501090648","19","19",1,1,1,"李秀兰","原",3,2));

		list.add(new Person("150104196504110029","19","19",1,1,1,"张双叶","原",3,2));

		list.add(new Person("150103196503022047","19","19",1,1,1,"付桂珍","原",3,2));

		list.add(new Person("150103195503241018","19","19",1,1,1,"李日升","原",3,1));

		list.add(new Person("150105195503271517","19","19",1,1,1,"卜拴才","原",3,1));

		list.add(new Person("150103195503210537","19","19",1,1,1,"范宝禄","原",3,1));

		list.add(new Person("150103196501252543","19","19",1,1,1,"姚丽萍","原",3,2));

		list.add(new Person("150103196504030081","19","19",1,1,1,"吴敏","原",3,2));

		list.add(new Person("150102196501262542","19","19",1,1,1,"吴丽艳","原",3,2));

		list.add(new Person("12010319650128542X","19","19",1,1,1,"黄媛霞","原",3,2));

		list.add(new Person("150103195501090113","19","19",1,1,1,"白益祥","原",3,1));

		list.add(new Person("150103196504281024","19","19",1,1,1,"云志华","原",3,2));

		list.add(new Person("150102196503153024","19","19",1,1,1,"王凤霞","原",3,2));

		list.add(new Person("150103195503020514","19","19",1,1,1,"丁润生","原",3,1));

		list.add(new Person("150104196503131020","19","19",1,1,1,"李文静","原",3,2));

		list.add(new Person("150103196503252029","19","19",1,1,1,"常丽梅","原",3,2));

		list.add(new Person("150102195504241515","19","19",1,1,1,"赵明志","原",3,1));

		list.add(new Person("150204196503310921","19","19",1,1,1,"李翻平","原",3,2));

		list.add(new Person("150102196411291526","19","19",1,1,1,"刘丽敏","原",3,2));

		list.add(new Person("150102196501302065","19","19",1,1,1,"梁慧卿","原",3,2));

		list.add(new Person("150103196504251028","19","19",1,1,1,"平丽霞","原",3,2));

		list.add(new Person("150102196503252022","19","19",1,1,1,"银秀清","原",3,2));

		list.add(new Person("150104195503150518","19","19",1,1,1,"齐黄涛","原",3,1));

		list.add(new Person("150102195504190519","19","19",1,1,1,"孙锐","原",3,1));

		list.add(new Person("15010419650404202X","19","19",1,1,1,"任春燕","原",3,2));

		list.add(new Person("150103196503012025","19","19",1,1,1,"许艳军","原",3,2));

		list.add(new Person("150104196408140527","19","19",1,1,1,"杨晓英","原",3,2));

		list.add(new Person("150104196504080528","19","19",1,1,1,"薛素荣","原",3,2));

		list.add(new Person("150102196505192529","19","19",1,1,1,"丁巧凤","原",3,2));

		list.add(new Person("150104196504180529","19","19",1,1,1,"于彩霞","原",3,2));

		list.add(new Person("15010519510410051X","19","19",1,1,1,"刘成刚","原",3,1));

		list.add(new Person("150102196504300049","19","19",1,1,1,"牛忱利","原",3,2));

		list.add(new Person("150103196504181023","19","19",1,1,1,"段小玲","原",3,2));

		list.add(new Person("150104195504040011","19","19",1,1,1,"杨继州","原",3,1));

		list.add(new Person("15010319650401054X","19","19",1,1,1,"李莉春","原",3,2));

		list.add(new Person("150102195502032517","19","19",1,1,1,"杜淦","原",3,1));

		list.add(new Person("150104196504190524","19","19",1,1,1,"王红娟","原",3,2));

		list.add(new Person("150103196504200044","19","19",1,1,1,"赵利平","原",3,2));

		list.add(new Person("150105196504204523","19","19",1,1,1,"胡建花","原",3,2));

		list.add(new Person("150103196502081547","19","19",1,1,1,"李雅林","原",3,2));

		list.add(new Person("150105196603200528","19","19",1,1,1,"陈丽芳","原",3,2));

		list.add(new Person("150103196501182020","19","19",1,1,1,"赵桂仙","原",3,2));

		list.add(new Person("150102196503253068","19","19",1,1,1,"单宝玲","原",3,2));

		list.add(new Person("152601196504020023","19","19",1,1,1,"张秀珍","原",3,2));

		list.add(new Person("150104196611282029","19","19",1,1,1,"李晓东","原",3,2));

		list.add(new Person("150104196504030627","19","19",1,1,1,"杨桂玉","原",3,2));

		list.add(new Person("150102195503031516","19","19",1,1,1,"侯全忠","原",3,1));

		list.add(new Person("150104195304071518","19","19",1,1,1,"靳振东","原",3,1));
		
		list.add(new Person("150102195401102010","19","19",1,1,1,"崔志","原",3,1));

		list.add(new Person("150104195504250019","19","19",1,1,1,"谢培忠","原",3,1));

		list.add(new Person("150104195504210017","19","19",1,1,1,"庞春生","原",3,1));

		list.add(new Person("150104196503011547","19","19",1,1,1,"冯丽萍","原",3,2));

		list.add(new Person("15010419650401052X","19","19",1,1,1,"武金香","原",3,2));

		list.add(new Person("150102196501212529","19","19",1,1,1,"乔敏","原",3,2));

		list.add(new Person("610103196503202022","19","19",1,1,1,"赵丽萍","原",3,2));

		list.add(new Person("150102196504160023","19","19",1,1,1,"杨春兰","原",3,2));

		list.add(new Person("150102196501154541","19","19",1,1,1,"李霞","原",3,2));

		list.add(new Person("150102196501253048","19","19",1,1,1,"李迎春","原",3,2));

		list.add(new Person("150104196502270520","19","19",1,1,1,"于仓莲","原",3,2));

		list.add(new Person("150102196709132528","19","19",1,1,1,"付玉文","原",3,2));

		list.add(new Person("15010319661003051X","19","19",1,1,1,"赵超","原",3,1));

		list.add(new Person("15012119630417514X","19","19",1,1,1,"张兰召","原",3,2));

		list.add(new Person("150102196111282513","19","19",1,1,1,"陈云","原",3,1));

		list.add(new Person("150104195403012011","19","19",1,1,1,"王炳泰","原",3,1));

		list.add(new Person("150105196404119022","19","19",1,1,1,"周开锋","原",3,2));

		list.add(new Person("150102196312244521","19","19",1,1,1,"包托亚","原",3,2));

		list.add(new Person("152104196211171241","19","19",1,1,1,"张玉芝","原",3,2));

		list.add(new Person("15010519590322253X","19","19",1,1,1,"云贵贵","原",3,1));

		list.add(new Person("150102196405180547","19","19",1,1,1,"李峰丽","原",3,2));

		list.add(new Person("15010519660115904X","19","19",1,1,1,"孙素丽","原",3,2));

		list.add(new Person("150102195405204014","19","19",1,1,1,"马麦栋","原",3,1));

		list.add(new Person("150123195003032629","19","19",1,1,1,"张秀女","原",3,2));

		list.add(new Person("150103195501150534","19","19",1,1,1,"张永祥","原",3,1));

		list.add(new Person("150105195401149010","19","19",1,1,1,"郝月明","原",3,1));

		list.add(new Person("152527196404010029","19","19",1,1,1,"张晓华","原",3,2));

		list.add(new Person("150104195406170015","19","19",1,1,1,"贾乐仁","原",3,1));

		list.add(new Person("150104196309080522","19","19",1,1,1,"张桂珍","原",3,2));

		list.add(new Person("150102195404194010","19","19",1,1,1,"王成功","原",3,1));

		list.add(new Person("152601196401031520","19","19",1,1,1,"李中华","原",3,2));

		list.add(new Person("150102196606244068","19","19",1,1,1,"王志轻","原",3,2));

		list.add(new Person("150103195606151023","19","19",1,1,1,"马翠花","原",3,2));

		list.add(new Person("150103196607200522","19","19",1,1,1,"梁爱连","原",3,2));

		list.add(new Person("150105196402229025","19","19",1,1,1,"石福团","原",3,2));

		list.add(new Person("150102195405150052","19","19",1,1,1,"海石","原",3,1));

		list.add(new Person("150102195403190018","19","19",1,1,1,"图布兴","原",3,1));

		list.add(new Person("150104196607140028","19","19",1,1,1,"云彩丽","原",3,2));

		list.add(new Person("150103196901251021","19","19",1,1,1,"韩秀梅","原",3,2));

		list.add(new Person("150105195407011514","19","19",1,1,1,"陆勇","原",3,1));

		list.add(new Person("15010219580605255X","19","19",1,1,1,"崔志国","原",3,1));

		list.add(new Person("15010219490705201X","19","19",1,1,1,"赵常富","原",3,1));

		list.add(new Person("150103196407191027","19","19",1,1,1,"任翠玲","原",3,2));

		list.add(new Person("150102196512054028","19","19",1,1,1,"乌兰其其格","原",3,2));

		list.add(new Person("150102196402250028","19","19",1,1,1,"任秀婷","原",3,2));

		list.add(new Person("150103196408212029","19","19",1,1,1,"库俊燕","原",3,2));

		list.add(new Person("150102195408022013","19","19",1,1,1,"刘志远","原",3,1));

		list.add(new Person("150102196408072023","19","19",1,1,1,"苑华","原",3,2));

		list.add(new Person("150103196406051145","19","19",1,1,1,"马书珍","原",3,2));

		list.add(new Person("150105196708012021","19","19",1,1,1,"云粉桃","原",3,2));

		list.add(new Person("150105196408084568","19","19",1,1,1,"刘利英","原",3,2));

		list.add(new Person("15010519640109902X","19","19",1,1,1,"许燕","原",3,2));

		list.add(new Person("150105196206010529","19","19",1,1,1,"闫东清","原",3,2));

		list.add(new Person("150102195408144539","19","19",1,1,1,"赵太平","原",3,1));

		list.add(new Person("152629196008231602","19","19",1,1,1,"李凤仙","原",3,2));

		list.add(new Person("150102196409250565","19","19",1,1,1,"李慧艳","原",3,2));

		list.add(new Person("150102195402182016","19","19",1,1,1,"刘春林","原",3,1));

		list.add(new Person("150103196609212041","19","19",1,1,1,"费福英","原",3,2));

		list.add(new Person("150103196409032628","19","19",1,1,1,"白新华","原",3,2));

		list.add(new Person("150104196410200584","19","19",1,1,1,"郭小林","原",3,2));

		list.add(new Person("15010519640905052X","19","19",1,1,1,"陈玉兰","原",3,2));

		list.add(new Person("150105196406099088","19","19",1,1,1,"刘月梅","原",3,2));

		list.add(new Person("152621195409282050","19","19",1,1,1,"赵贵明","原",3,1));

		list.add(new Person("150102195410014012","19","19",1,1,1,"郑希君","原",3,1));

		list.add(new Person("150102196410061542","19","19",1,1,1,"张美菊","原",3,2));

		list.add(new Person("150105195410094517","19","19",1,1,1,"王铁锁","原",3,1));

		list.add(new Person("152601196411062566","19","19",1,1,1,"池建萍","原",3,2));

		list.add(new Person("150105196311058523","19","19",1,1,1,"牡丹","原",3,2));

		list.add(new Person("150102196309230065","19","19",1,1,1,"许晋冀","原",3,2));

		list.add(new Person("150103196410131527","19","19",1,1,1,"刘素梅","原",3,2));

		list.add(new Person("15010519591023052X","19","19",1,1,1,"贾仙萍","原",3,2));

		list.add(new Person("150102196102130024","19","19",1,1,1,"刘美清","原",3,2));

		list.add(new Person("150104196602090025","19","19",1,1,1,"李翠玲","原",3,2));

		list.add(new Person("150104196205100023","19","19",1,1,1,"王换玲","原",3,2));

		list.add(new Person("152823196411183121","19","19",1,1,1,"郭利花","原",3,2));

		list.add(new Person("150102196411160606","19","19",1,1,1,"徐双","原",3,2));

		list.add(new Person("150102196411284545","19","19",1,1,1,"苏秀清","原",3,2));

		list.add(new Person("150102196411190047","19","19",1,1,1,"魏文英","原",3,2));

		list.add(new Person("150104195906030510","19","19",1,1,1,"张廉卿","原",3,1));

		list.add(new Person("150102196411142061","19","19",1,1,1,"张晓霞","原",3,2));

		list.add(new Person("150102196408272527","19","19",1,1,1,"杨翠芳","原",3,2));

		list.add(new Person("150102196402092568","19","19",1,1,1,"刘燕萍","原",3,2));

		list.add(new Person("150105195905132511","19","19",1,1,1,"岳双","原",3,1));

		list.add(new Person("150102196508163029","19","19",1,1,1,"刘改莲","原",3,2));

		list.add(new Person("150103195011181071","19","19",1,1,1,"杨进东","原",3,1));

		list.add(new Person("150103196411251571","19","19",1,1,1,"孙义","原",3,1));

		list.add(new Person("152624196406120623","19","19",1,1,1,"李海峰","原",3,2));

		list.add(new Person("150102196201156027","19","19",1,1,1,"徐彦萍","原",3,2));

		list.add(new Person("152621196402182625","19","19",1,1,1,"李汇涛","原",3,2));

		list.add(new Person("150104196411270584","19","19",1,1,1,"张玉勤","原",3,2));

		list.add(new Person("150103196211132025","19","19",1,1,1,"尹四平","原",3,2));

		list.add(new Person("150103195401080516","19","19",1,1,1,"云世杰","原",3,1));

		list.add(new Person("150102196412282525","19","19",1,1,1,"李玉英","原",3,2));

		list.add(new Person("150105195812129065","19","19",1,1,1,"高桂兰","原",3,2));

		list.add(new Person("150122196312212525","19","19",1,1,1,"闫三连","原",3,2));

		list.add(new Person("150105195410029037","19","19",1,1,1,"寿建龙","原",3,1));

		list.add(new Person("150102196304053020","19","19",1,1,1,"贾睿坤","原",3,2));

		list.add(new Person("150105196703199026","19","19",1,1,1,"郭文枝","原",3,2));

		list.add(new Person("150102196212151520","19","19",1,1,1,"白桂馨","原",3,2));

		list.add(new Person("150105196103079012","19","19",1,1,1,"卢占奎","原",3,1));

		list.add(new Person("150105196411107820","19","19",1,1,1,"段晓清","原",3,2));

		list.add(new Person("150102196212023035","19","19",1,1,1,"张占林","原",3,1));

		list.add(new Person("130984196012190925","19","19",1,1,1,"刘秀芬","原",3,2));

		list.add(new Person("150103196412020521","19","19",1,1,1,"吕秀花","原",3,2));

		list.add(new Person("150102196405264046","19","19",1,1,1,"刘淑萍","原",3,2));

		list.add(new Person("150303196505221024","19","19",1,1,1,"王利峰","原",3,2));

		list.add(new Person("150103195910042032","19","19",1,1,1,"朱敬","原",3,1));

		list.add(new Person("150104196111220518","19","19",1,1,1,"崔培盛","原",3,1));

		list.add(new Person("150102196410081519","19","19",1,1,1,"赵宁宁","原",3,1));

		list.add(new Person("150104196503200524","19","19",1,1,1,"冯世娟","原",3,2));

		list.add(new Person("150103196502020541","19","19",1,1,1,"斯琴高娃","原",3,2));

		list.add(new Person("150104196502230020","19","19",1,1,1,"郭丽君","原",3,2));

		list.add(new Person("150104196612310028","19","19",1,1,1,"母慧洁","原",3,2));

		list.add(new Person("230103196303015184","19","19",1,1,1,"姜杰裕","原",3,2));

		list.add(new Person("150102196601064586","19","19",1,1,1,"高风格","原",3,2));

		list.add(new Person("152631196012276928","19","19",1,1,1,"魏果花","原",3,2));

		list.add(new Person("150103195501012019","19","19",1,1,1,"刘瑛","原",3,1));

		list.add(new Person("150102196502030022","19","19",1,1,1,"王燕","原",3,2));

		list.add(new Person("150102197001040526","19","19",1,1,1,"吕俊莉","原",3,2));

		list.add(new Person("150102196701261528","19","19",1,1,1,"李晓燕","原",3,2));

		list.add(new Person("150103196001122515","19","19",1,1,1,"康世义","原",3,1));

		list.add(new Person("152601196501080047","19","19",1,1,1,"米得格","原",3,2));

		list.add(new Person("150103196501011563","19","19",1,1,1,"田莉萍","原",3,2));

		list.add(new Person("152624195502101516","19","19",1,1,1,"聂光明","原",3,1));

		list.add(new Person("150103196501302547","19","19",1,1,1,"杨丽娟","原",3,2));

		list.add(new Person("150104196902060020","19","19",1,1,1,"程晓荣","原",3,2));

		list.add(new Person("150103195503140014","19","19",1,1,1,"武红用","原",3,1));

		list.add(new Person("150104196609230027","19","19",1,1,1,"李彦俊","原",3,2));

		list.add(new Person("150105196502173524","19","19",1,1,1,"闫秀英","原",3,2));

		list.add(new Person("150104196501150543","19","19",1,1,1,"李月明","原",3,2));

		list.add(new Person("142122195502046017","19","19",1,1,1,"薛桂山","原",3,1));

		list.add(new Person("150103196412102623","19","19",1,1,1,"杨芳茹","原",3,2));

		list.add(new Person("150103196802211067","19","19",1,1,1,"高超群","原",3,2));

		list.add(new Person("150103196001312511","19","19",1,1,1,"崔利平","原",3,1));

		list.add(new Person("150102196501280521","19","19",1,1,1,"费彩霞","原",3,2));

		list.add(new Person("150222195411245016","19","19",1,1,1,"路保林","原",3,1));

		list.add(new Person("150102196502051527","19","19",1,1,1,"侯殿华","原",3,2));

		list.add(new Person("150105195503069038","19","19",1,1,1,"银润维","原",3,1));

		list.add(new Person("150105196502019041","19","19",1,1,1,"邸美云","原",3,2));

		list.add(new Person("150103196501280026","19","19",1,1,1,"李海云","原",3,2));

		list.add(new Person("150103196011270044","19","19",1,1,1,"董翠丽","原",3,2));

		list.add(new Person("15010319620106302X","19","19",1,1,1,"田改花","原",3,2));

		list.add(new Person("150104196501080522","19","19",1,1,1,"王晓霞","原",3,2));

		list.add(new Person("150103196210141077","19","19",1,1,1,"章浩毅","原",3,1));

		list.add(new Person("150102195501052532","19","19",1,1,1,"靳满喜","原",3,1));

		list.add(new Person("15010319650213002X","19","19",1,1,1,"邵桂玲","原",3,2));

		list.add(new Person("152823195902120526","19","19",1,1,1,"张和平","原",3,2));

		list.add(new Person("150104195501050556","19","19",1,1,1,"刘斌","原",3,1));

		list.add(new Person("150105195501291532","19","19",1,1,1,"段海生","原",3,1));

		list.add(new Person("15010419550111103X","19","19",1,1,1,"梁富贵","原",3,1));

		list.add(new Person("150121195308134615","19","19",1,1,1,"郭新民","原",3,1));

		list.add(new Person("150105196403190521","19","19",1,1,1,"张春云","原",3,2));

		list.add(new Person("150104196502260525","19","19",1,1,1,"杨彦平","原",3,2));

		list.add(new Person("150104196502030121","19","19",1,1,1,"郑春云","原",3,2));

		list.add(new Person("150102196501272062","19","19",1,1,1,"王姬玉","原",3,2));

		list.add(new Person("150102197803254622","19","19",1,1,1,"尹芳","原",3,2));

		list.add(new Person("150103196503061521","19","19",1,1,1,"杜静","原",3,2));

		list.add(new Person("15012119530807101X","19","19",1,1,1,"郭福荣","原",3,1));

		list.add(new Person("150102196311121028","19","19",1,1,1,"常俊英","原",3,2));

		list.add(new Person("150104195501061538","19","19",1,1,1,"杨守祥","原",3,1));

		list.add(new Person("152628196301236481","19","19",1,1,1,"杜改叶","原",3,2));

		list.add(new Person("152634196503081526","19","19",1,1,1,"王丽云","原",3,2));

		list.add(new Person("150103195901281525","19","19",1,1,1,"杜敏","原",3,2));

		list.add(new Person("152801196502040662","19","19",1,1,1,"何勤英","原",3,2));

		list.add(new Person("150105195902024523","19","19",1,1,1,"杨润荷","原",3,2));

		list.add(new Person("150102196503080048","19","19",1,1,1,"冯秀兰","原",3,2));

		list.add(new Person("150102195502280019","19","19",1,1,1,"梁金仓","原",3,1));

		list.add(new Person("150105195503030539","19","19",1,1,1,"王明奎","原",3,1));

		list.add(new Person("150104195502071519","19","19",1,1,1,"谢德元","原",3,1));

		list.add(new Person("150104196504090048","19","19",1,1,1,"刘玉英","原",3,2));

		list.add(new Person("15010219550201401X","19","19",1,1,1,"胡庆士","原",3,1));

		list.add(new Person("150103195906301011","19","19",1,1,1,"吴晋山","原",3,1));

		list.add(new Person("642101196301030087","19","19",1,1,1,"刘连英","原",3,2));

		list.add(new Person("150104195501111013","19","19",1,1,1,"乔德","原",3,1));

		list.add(new Person("150102195502281513","19","19",1,1,1,"张守信","原",3,1));

		list.add(new Person("150104195503140010","19","19",1,1,1,"张永宏","原",3,1));

		list.add(new Person("150105196502080563","19","19",1,1,1,"杨春桃","原",3,2));

		list.add(new Person("150103196503150022","19","19",1,1,1,"杨彩霞","原",3,2));

		list.add(new Person("150102196502253525","19","19",1,1,1,"高平","原",3,2));

		list.add(new Person("152827195902250086","19","19",1,1,1,"姜春梅","原",3,2));

		list.add(new Person("150202196003290343","19","19",1,1,1,"李丽萍","原",3,2));

		list.add(new Person("150103196501141026","19","19",1,1,1,"陈素芳","原",3,2));

		list.add(new Person("150103195802212516","19","19",1,1,1,"白钧","原",3,1));

		list.add(new Person("150105196011110529","19","19",1,1,1,"武改风","原",3,2));

		list.add(new Person("150104195503120538","19","19",1,1,1,"孙志义","原",3,1));

		list.add(new Person("150105196208309021","19","19",1,1,1,"王俊清","原",3,2));

		list.add(new Person("150105196401130525","19","19",1,1,1,"靳梅花","原",3,2));

		list.add(new Person("150103196504072521","19","19",1,1,1,"邸丽亚","原",3,2));

		list.add(new Person("150103196501311523","19","19",1,1,1,"张金凤","原",3,2));

		list.add(new Person("150103196501120049","19","19",1,1,1,"陈月先","原",3,2));

		list.add(new Person("150105196409265027","19","19",1,1,1,"张翠平","原",3,2));

		list.add(new Person("150104196502260023","19","19",1,1,1,"武仙梅","原",3,2));

		list.add(new Person("150105196501169021","19","19",1,1,1,"王丽萍","原",3,2));

		list.add(new Person("150103196502060527","19","19",1,1,1,"郝东华","原",3,2));

		list.add(new Person("15010419550224001X","19","19",1,1,1,"练荣生","原",3,1));

		list.add(new Person("150105195502152016","19","19",1,1,1,"孟祥","原",3,1));

		list.add(new Person("152529196404192726","19","19",1,1,1,"闫荣","原",3,2));

		list.add(new Person("150104195502181515","19","19",1,1,1,"郭锦章","原",3,1));

		list.add(new Person("150104195503211157","19","19",1,1,1,"郭忠山","原",3,1));

		list.add(new Person("150104196611140565","19","19",1,1,1,"刘红梅","原",3,2));

		list.add(new Person("150104195501041537","19","19",1,1,1,"韩明源","原",3,1));

		list.add(new Person("152621196103112061","19","19",1,1,1,"于凤枝","原",3,2));

		list.add(new Person("150104195411100011","19","19",1,1,1,"陈宁生","原",3,1));

		list.add(new Person("150102195503130039","19","19",1,1,1,"郭起赟","原",3,1));

		list.add(new Person("150105196210150603","19","19",1,1,1,"沈艮梅","原",3,2));

		list.add(new Person("152622195306083012","19","19",1,1,1,"王根拴","原",3,1));

		list.add(new Person("150102196504252526","19","19",1,1,1,"刘丽","原",3,2));

		list.add(new Person("150221196409250324","19","19",1,1,1,"李小娥","原",3,2));

		list.add(new Person("150102195501144517","19","19",1,1,1,"李波","原",3,1));

		list.add(new Person("152601196109193629","19","19",1,1,1,"薛青","原",3,2));

		list.add(new Person("15010319650108202X","19","19",1,1,1,"党根莲","原",3,2));

		list.add(new Person("15010519641002402X","19","19",1,1,1,"赵巧巧","原",3,2));

		list.add(new Person("150103196502211524","19","19",1,1,1,"闫春燕","原",3,2));

		list.add(new Person("150104195501261054","19","19",1,1,1,"王文亮","原",3,1));

		list.add(new Person("150105196502143528","19","19",1,1,1,"张金梅","原",3,2));

		list.add(new Person("150104195501110010","19","19",1,1,1,"刘福厚","原",3,1));

		list.add(new Person("15010519550525902X","19","19",1,1,1,"王群一","原",3,2));

		list.add(new Person("150102196406052520","19","19",1,1,1,"王小兰","原",3,2));

		list.add(new Person("150102195411184515","19","19",1,1,1,"姜希来","原",3,1));

		list.add(new Person("150103196408071078","19","19",1,1,1,"刘勇","原",3,1));

		list.add(new Person("152601196503091049","19","19",1,1,1,"田玉兰","原",3,2));

		list.add(new Person("150102196502202525","19","19",1,1,1,"李新民","原",3,2));

		list.add(new Person("150103196412030025","19","19",1,1,1,"韩丽","原",3,2));

		list.add(new Person("15010219630604454X","19","19",1,1,1,"斯庆","原",3,2));

		list.add(new Person("150102195501232015","19","19",1,1,1,"杨云峰","原",3,1));

		list.add(new Person("150103195503142511","19","19",1,1,1,"曹春友","原",3,1));

		list.add(new Person("15010319650218102X","19","19",1,1,1,"张玉英","原",3,2));

		list.add(new Person("150104196501270529","19","19",1,1,1,"赵晓玲","原",3,2));

		list.add(new Person("150104195503210031","19","19",1,1,1,"李守洁","原",3,1));

		list.add(new Person("150102196410312532","19","19",1,1,1,"郭志宏","原",3,1));

		list.add(new Person("150103196403241066","19","19",1,1,1,"张巧娥","原",3,2));

		list.add(new Person("15010219540713315X","19","19",1,1,1,"庞立浦","原",3,1));

		list.add(new Person("150105196502104027","19","19",1,1,1,"坤贵桃","原",3,2));

		list.add(new Person("150103196709251021","19","19",1,1,1,"安国瑜","原",3,2));

		list.add(new Person("150104195503180012","19","19",1,1,1,"潘世和","原",3,1));

		list.add(new Person("150103195503311039","19","19",1,1,1,"胡伟","原",3,1));

		list.add(new Person("150104196502111028","19","19",1,1,1,"陈秀兰","原",3,2));

		list.add(new Person("150105196409223021","19","19",1,1,1,"周丽娟","原",3,2));

		list.add(new Person("150105196503229040","19","19",1,1,1,"崔小霞","原",3,2));

		list.add(new Person("15232119650112394X","19","19",1,1,1,"代春兰","原",3,2));

		list.add(new Person("150103195906202013","19","19",1,1,1,"郭建荣","原",3,1));

		list.add(new Person("150103196502201027","19","19",1,1,1,"周红玲","原",3,2));

		list.add(new Person("150102196503161024","19","19",1,1,1,"徐红霞","原",3,2));

		list.add(new Person("15010419550308205X","19","19",1,1,1,"高林生","原",3,1));

		list.add(new Person("150104196501040520","19","19",1,1,1,"李毓民","原",3,2));

		list.add(new Person("152323196503167228","19","19",1,1,1,"斯琴","原",3,2));

		list.add(new Person("150103196503251528","19","19",1,1,1,"卢宝贞","原",3,2));

		list.add(new Person("150104196503131522","19","19",1,1,1,"王智慧","原",3,2));

		list.add(new Person("150103196501091129","19","19",1,1,1,"王玉连","原",3,2));

		list.add(new Person("150121196502168223","19","19",1,1,1,"陶巧林","原",3,2));

		list.add(new Person("150103196503152028","19","19",1,1,1,"赵昌香","原",3,2));

		list.add(new Person("15260119650223102X","19","19",1,1,1,"申慧琴","原",3,2));

		list.add(new Person("150102196504173123","19","19",1,1,1,"温爱琴","原",3,2));

		list.add(new Person("15010319650328002X","19","19",1,1,1,"庞秀梅","原",3,2));

		list.add(new Person("150104196502011027","19","19",1,1,1,"杜炯卿","原",3,2));

		list.add(new Person("150104195503221013","19","19",1,1,1,"蔺继永","原",3,1));

		list.add(new Person("150102195501202051","19","19",1,1,1,"高峰","原",3,1));

		list.add(new Person("150103196503261128","19","19",1,1,1,"武凤凤","原",3,2));

		list.add(new Person("150102196311282569","19","19",1,1,1,"周丽荣","原",3,2));

		list.add(new Person("150105196412211523","19","19",1,1,1,"魏引弟","原",3,2));

		list.add(new Person("150103195512080535","19","19",1,1,1,"郑纯世","原",3,1));

		list.add(new Person("150302195503053011","19","19",1,1,1,"武建成","原",3,1));

		list.add(new Person("150105196502130524","19","19",1,1,1,"杨玉珍","原",3,2));

		list.add(new Person("150104195502172010","19","19",1,1,1,"高建华","原",3,1));

		list.add(new Person("152601196502210528","19","19",1,1,1,"王桂玲","原",3,2));

		list.add(new Person("150102195503281515","19","19",1,1,1,"程二庄","原",3,1));

		list.add(new Person("152601196602201522","19","19",1,1,1,"董小雪","原",3,2));

		list.add(new Person("150103195502110518","19","19",1,1,1,"白明生","原",3,1));

		list.add(new Person("150102196404031566","19","19",1,1,1,"郝花","原",3,2));

		list.add(new Person("150102196504240525","19","19",1,1,1,"王静","原",3,2));

		list.add(new Person("15010319551130201X","19","19",1,1,1,"赵敏生","原",3,1));

		list.add(new Person("150104196504240544","19","19",1,1,1,"乔玉萍","原",3,2));

		list.add(new Person("150102195502134038","19","19",1,1,1,"龚国华","原",3,1));

		list.add(new Person("15010519630422102X","19","19",1,1,1,"徐秀珍","原",3,2));

		list.add(new Person("150105196504299067","19","19",1,1,1,"张秀清","原",3,2));

		list.add(new Person("150103196503072028","19","19",1,1,1,"张巧英","原",3,2));

		list.add(new Person("150104196501310527","19","19",1,1,1,"刘少棠","原",3,2));

		list.add(new Person("150103196202012048","19","19",1,1,1,"张金平","原",3,2));

		list.add(new Person("230802196409060946","19","19",1,1,1,"赵明","原",3,2));


		list.add(new Person("150102196503290520","19","19",1,1,1,"郭艳英","原",3,2));

		list.add(new Person("150102196502063027","19","19",1,1,1,"段凤林","原",3,2));

		list.add(new Person("150105195501054510","19","19",1,1,1,"董永善","原",3,1));

		list.add(new Person("150105196504040581","19","19",1,1,1,"刘德芬","原",3,2));

		list.add(new Person("150104195504061015","19","19",1,1,1,"冯瑛","原",3,1));

		list.add(new Person("152601196504150522","19","19",1,1,1,"张美秀","原",3,2));

		list.add(new Person("152631196004026021","19","19",1,1,1,"李颜春","原",3,2));

		list.add(new Person("150103196502270524","19","19",1,1,1,"马建茹","原",3,2));

		list.add(new Person("150103196004240517","19","19",1,1,1,"白文孝","原",3,1));


		list.add(new Person("150103196004282522","19","19",1,1,1,"田丹","原",3,2));

		list.add(new Person("150104196910290029","19","19",1,1,1,"聂红燕","原",3,2));

		list.add(new Person("150104196504040585","19","19",1,1,1,"尚芳素","原",3,2));

		list.add(new Person("150104196508121024","19","19",1,1,1,"陈丽君","原",3,2));

		list.add(new Person("150104196504211022","19","19",1,1,1,"王秀兰","原",3,2));

		list.add(new Person("150102196503022040","19","19",1,1,1,"张晓军","原",3,2));

		list.add(new Person("150104196504040569","19","19",1,1,1,"杨小丽","原",3,2));

		list.add(new Person("150104195409082037","19","19",1,1,1,"段志力","原",3,1));

		list.add(new Person("150103195503171013","19","19",1,1,1,"于德起","原",3,1));

		list.add(new Person("150102196504064525","19","19",1,1,1,"马秉春","原",3,2));

		list.add(new Person("150105195202270512","19","19",1,1,1,"吴有金","原",3,1));

		list.add(new Person("15010419650422154X","19","19",1,1,1,"徐树英","原",3,2));

		list.add(new Person("150104195503271037","19","19",1,1,1,"董俊","原",3,1));

		list.add(new Person("150104196504020023","19","19",1,1,1,"任玉芳","原",3,2));

		list.add(new Person("150103195506182017","19","19",1,1,1,"白福生","原",3,1));

		list.add(new Person("150102195504121011","19","19",1,1,1,"靳安富","原",3,1));


		list.add(new Person("150102195504160512","19","19",1,1,1,"席友梅","原",3,1));


		list.add(new Person("150104196304132629","19","19",1,1,1,"张海霞","原",3,2));

		list.add(new Person("150102195501310511","19","19",1,1,1,"王世忠","原",3,1));

		list.add(new Person("150105196403159065","19","19",1,1,1,"雷翠林","原",3,2));


		list.add(new Person("15010519550422153X","19","19",1,1,1,"张维元","原",3,1));

		list.add(new Person("152622196501014025","19","19",1,1,1,"刘林叶","原",3,2));

		list.add(new Person("150103196502221546","19","19",1,1,1,"焦熔丽","原",3,2));

		list.add(new Person("150105195504050013","19","19",1,1,1,"王亚非","原",3,1));

		list.add(new Person("150103195504211515","19","19",1,1,1,"姚忠勤","原",3,1));

		list.add(new Person("15010319650121001X","19","19",1,1,1,"宋志忠","原",3,1));

		list.add(new Person("150121196403126722","19","19",1,1,1,"王月英","原",3,2));

		list.add(new Person("150103196504111025","19","19",1,1,1,"武素荣","原",3,2));

		list.add(new Person("150105196407020546","19","19",1,1,1,"赵栓云","原",3,2));

		list.add(new Person("150102196504114625","19","19",1,1,1,"杨晓梅","原",3,2));

		list.add(new Person("150104196505191027","19","19",1,1,1,"王金兰","原",3,2));

		list.add(new Person("150104196409290025","19","19",1,1,1,"杨君妹","原",3,2));

		list.add(new Person("150125195503123925","19","19",1,1,1,"刘小叶","原",3,2));

		list.add(new Person("150125196111271827","19","19",1,1,1,"宁林弟","原",3,2));

		list.add(new Person("150102195503010010","19","19",1,1,1,"杨孝","原",3,1));

		list.add(new Person("150104195502021554","19","19",1,1,1,"郑金锁","原",3,1));

		list.add(new Person("150104196504210521","19","19",1,1,1,"宋丽琴","原",3,2));

		list.add(new Person("150103196604051525","19","19",1,1,1,"苑翠清","原",3,2));

		list.add(new Person("150102196504263022","19","19",1,1,1,"睢利清","原",3,2));

		list.add(new Person("150103196504221523","19","19",1,1,1,"黄丽萍","原",3,2));

		list.add(new Person("150102196504294080","19","19",1,1,1,"王淑仙","原",3,2));

		list.add(new Person("150104195504290010","19","19",1,1,1,"杨润生","原",3,1));

		list.add(new Person("150104195503051536","19","19",1,1,1,"程春","原",3,1));

		list.add(new Person("150104195504180532","19","19",1,1,1,"张秃喜","原",3,1));

		list.add(new Person("150105195504229013","19","19",1,1,1,"张宏伟","原",3,1));

		list.add(new Person("150102196504200523","19","19",1,1,1,"程秀英","原",3,2));

		list.add(new Person("15010319640812052X","19","19",1,1,1,"李淑敏","原",3,2));

		list.add(new Person("152627196504163765","19","19",1,1,1,"罗国芳","原",3,2));

		list.add(new Person("150102196503232128","19","19",1,1,1,"李燕","原",3,2));

		list.add(new Person("13282819650416442X","19","19",1,1,1,"李小英","原",3,2));

		list.add(new Person("150102195501173019","19","19",1,1,1,"王新建","原",3,1));

		list.add(new Person("150104195504200513","19","19",1,1,1,"续建礼","原",3,1));

		list.add(new Person("150104196412020042","19","19",1,1,1,"柳玉英","原",3,2));

		list.add(new Person("150104195612241531","19","19",1,1,1,"宋国柱","原",3,1));


		list.add(new Person("150105196210094541","19","19",1,1,1,"云丽萍","原",3,2));


		list.add(new Person("150121196201055022","19","19",1,1,1,"于长杰","原",3,2));

		list.add(new Person("152601196503170548","19","19",1,1,1,"牛改玲","原",3,2));

		list.add(new Person("150103196504222024","19","19",1,1,1,"哈斯花","原",3,2));

		list.add(new Person("150105195504186519","19","19",1,1,1,"云伟俊","原",3,1));

		list.add(new Person("150105196504189028","19","19",1,1,1,"狄玉英","原",3,2));

		list.add(new Person("620503196508210711","19","19",1,1,1,"王清","原",3,1));

		list.add(new Person("150105196207092043","19","19",1,1,1,"李桂英","原",3,2));

		list.add(new Person("150105196501151526","19","19",1,1,1,"崔瑞梅","原",3,2));


		list.add(new Person("150103196504182042","19","19",1,1,1,"李露","原",3,2));

		list.add(new Person("150102196303064545","19","19",1,1,1,"白丽芳","原",3,2));

		list.add(new Person("150105196103010525","19","19",1,1,1,"李美云","原",3,2));

		list.add(new Person("150104196504151525","19","19",1,1,1,"李素萍","原",3,2));

		list.add(new Person("150105196012147817","19","19",1,1,1,"哈斯","原",3,1));


		list.add(new Person("150103196504281526","19","19",1,1,1,"贾娟","原",3,2));

		list.add(new Person("150103196502061124","19","19",1,1,1,"刘素兰","原",3,2));

		list.add(new Person("150104196611030622","19","19",1,1,1,"王爱平","原",3,2));

		list.add(new Person("150104196503051047","19","19",1,1,1,"崔润莲","原",3,2));

		list.add(new Person("15010419550305151X","19","19",1,1,1,"赵增平","原",3,1));

		list.add(new Person("150103195410041033","19","19",1,1,1,"郭利民","原",3,1));

		list.add(new Person("150102195503174517","19","19",1,1,1,"罗双猛","原",3,1));

		list.add(new Person("150102196302240535","19","19",1,1,1,"崔广善","原",3,1));

		list.add(new Person("150121196504027643","19","19",1,1,1,"樊宏英","原",3,2));

		list.add(new Person("150102195709244031","19","19",1,1,1,"杨兴周","原",3,1));

		list.add(new Person("152824196502060027","19","19",1,1,1,"王玉英","原",3,2));

		list.add(new Person("150103196209261047","19","19",1,1,1,"张利香","原",3,2));

		list.add(new Person("152621196104180525","19","19",1,1,1,"赵二仙","原",3,2));

		list.add(new Person("340621196504170346","19","19",1,1,1,"李云侠","原",3,2));

		list.add(new Person("150102196503021523","19","19",1,1,1,"阿切","原",3,2));

		list.add(new Person("150102195501041518","19","19",1,1,1,"赵文琪","原",3,1));

		list.add(new Person("150102196212054528","19","19",1,1,1,"罗龙玉","原",3,2));

		list.add(new Person("150104195503180039","19","19",1,1,1,"王永存","原",3,1));


		list.add(new Person("150123196412170023","19","19",1,1,1,"王清","原",3,2));

		list.add(new Person("150105195211280536","19","19",1,1,1,"冯集生","原",3,1));

		list.add(new Person("150103196501080120","19","19",1,1,1,"冯凤娴","原",3,2));

		list.add(new Person("150105195501129033","19","19",1,1,1,"顾文旭","原",3,1));

		list.add(new Person("150103196008212564","19","19",1,1,1,"马利平","原",3,2));

		list.add(new Person("150103196504292049","19","19",1,1,1,"于全枝","原",3,2));

		list.add(new Person("132527196411215029","19","19",1,1,1,"魏永桃","原",3,2));

		list.add(new Person("150102196504122545","19","19",1,1,1,"崔彦","原",3,2));

		list.add(new Person("150105196504304524","19","19",1,1,1,"李秀珍","原",3,2));

		list.add(new Person("150104196605031020","19","19",1,1,1,"王润琴","原",3,2));

		list.add(new Person("150103195402051012","19","19",1,1,1,"张立根","原",3,1));

		list.add(new Person("150102196403080112","19","19",1,1,1,"郑利军","原",3,1));

		list.add(new Person("150102196501120560","19","19",1,1,1,"赵芬梅","原",3,2));

		list.add(new Person("150102196503024046","19","19",1,1,1,"杨杰","原",3,2));

		list.add(new Person("150105196502079028","19","19",1,1,1,"鹿秀清","原",3,2));

		list.add(new Person("15010319540319201X","19","19",1,1,1,"武金忠","原",3,1));

		list.add(new Person("152502196412310227","19","19",1,1,1,"车永珍","原",3,2));

		list.add(new Person("150102195503200578","19","19",1,1,1,"孟广星","原",3,1));

		list.add(new Person("150105196503172048","19","19",1,1,1,"王爱桃","原",3,2));

		list.add(new Person("150103196610201040","19","19",1,1,1,"郭文莲","原",3,2));

		list.add(new Person("150104196304080048","19","19",1,1,1,"赵美丽","原",3,2));

		list.add(new Person("150103196308011510","19","19",1,1,1,"谢云博","原",3,1));





		










		




		
		
		

////////////////////////////////////////////////////////////////////////////////////////////////////////////////



		

		
//		list.add(new Person("150103196312300569","1963-12","19",1,1,1,"罗玲","内蒙古捷欣置业有限责任公司",1,2));
//
//		list.add(new Person("142224195107030793","1951-07","19",1,1,1,"王补槐","内蒙古伊利实业集团股份有限公司",1,1));
//
//		list.add(new Person("150121195203021059","1952-03","19",1,1,1,"郝永生","土默特左旗电力有限责任公司",1,1));
//		
//		list.add(new Person("150105196404119022","1964-04","19",1,1,1,"周开锋","",3,2)); 不到龄 1966

		


		
		
		
//		
		
		
		
///////////////2014/////////////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
		
		
		
		
		
		
		
		
		
		
		
//		list.add(new Person("1312050158860089 ",3,2,"1963-11","1981-12",1,1,1,"赵英","原特药长购供应站"));//干部身份重写申请
//
//		list.add(new Person("1312030158860085 ",4,2,"1963-10","1986-09",1,1,3,"静秋","原内蒙物资集团"));
		
		
		
		


		
		
		
//		2013-12-25
////////////////////////////////////////////////////////////////////////////////////////
		
		
		
//		方自瑞	陈俊平	马彪
//		刘兴泉	2012-301
//		杨利强	2012-296
//		赵树根	2012-294
		
//		list.add(new Person("1309090158860110 ",4,1,"1961-09","1982-01",1,2,"2012-290",1,"韩晓瑞","原内蒙供销社贸易公司","2013-07-30"));
//		
//		list.add(new Person("1309090158860036 ",3,1,"1963-01","1981-12",1,2,"2012-298",1,"常宗豪","原呼市配合饲料厂","2013-04-30"));
//		
//		list.add(new Person("1309100158860053 ",3,1,"1960-08","1975-10",1,2,"2012-",1,"魏国荣","原铁骑集团","2013-07-30"));
//		
//		list.add(new Person("1309090158860119 ",4,1,"1963-05","1981-06",1,2,"2012-292",1,"孙永涛","原中国黑色金属材料内蒙公司","2013-05-30"));
//		
//		list.add(new Person("1309100158860033 ",3,1,"1962-09","1979-10",1,2,"2012-299",1,"张福虎","原制锁公司","2013-09-30"));
//		
//		
//		
//		
//		list.add(new Person("1309250158860006 ",1,2,"1963-10","1983-11",1,1,1,"巩丽蓉","内蒙古名都房地产开发有限责任公司"));
//		
//		list.add(new Person("1309250158860035 ",1,2,"1963-10","1983-03",1,1,1,"张丽君","阳光人寿保险股份有限责任公司内蒙古分公司"));
		
		
		
		
//		list.add(new Person("1306260158860156 ",3,2,"1963-01","1981-02",1,1,1,"敖腾其木格","原内蒙古牧民招待所"));   没有买断协议书		
		
		
		
		
		
		
		
		
//		list.add(new Person("1307150158860162 ",3,2,"1962-02","1987-10",1,1,1,"刘凤珍","原轮胎翻修厂"));  查下乡登记表

		
		
		
//		list.add(new Person("1307150158860055 ",3,2,"1967-04","1983-04",1,1,1,"白丽青","原木林饭店"));   退
		
		
//		list.add(new Person("1307310158860146",3,2,"1963-07","1988-04",1,1,1,"张润平","原三毛"));  查占地协议和花名册
		
//		list.add(new Person("1308010158860111 ",3,2,"1963-03","1980-12",1,1,1,"张凤云","原铁骑集团")); 李姐
		
		
		

		

		
		


		
				

		

		

		

		
		



		

		
		
		
		

		

		

		
		

		

	

		


		

		
		
		

		

		

		
		
		


			
		

		
		
		
		
		
		remark = "3";
//		remark = "2";
//		remark = "1";
//		,"2013-01-30"
//		,"2013-04-30"
//		全	444
//		list.add(new Person("                ",3,1,"1953-06","197",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,1,"1953-05","197",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,1,"1953-04","197",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,1,"1953-03","197",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,1,"1953-02","197",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,1,"1953-01","197",1,1,1,"大大大","原"));


//		list.add(new Person("                ",3,2,"1963-06","198",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,2,"1963-05","198",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,2,"1963-04","198",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,2,"1963-03","198",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,2,"1963-02","198",1,1,1,"大大大","原"));
//		list.add(new Person("                ",3,2,"1963-01","198",1,1,1,"大大大","原"));
		

		
//		list.add(new Person("                ",3,1,"1953-12","196",1,1,1,"大大大","原","2013-12-30"));
//		list.add(new Person("                ",3,1,"1953-11","196",1,1,1,"大大大","原","2013-11-30"));
//		list.add(new Person("                ",3,1,"1953-10","196",1,1,1,"大大大","原","2013-10-30"));
//		list.add(new Person("                ",3,1,"1953-09","196",1,1,1,"大大大","原","2013-09-30"));
//		list.add(new Person("                ",3,1,"1953-08","196",1,1,1,"大大大","原","2013-08-30"));
//		list.add(new Person("                ",3,1,"1953-07","196",1,1,1,"大大大","原","2013-07-30"));
//		list.add(new Person("                ",3,1,"1953-06","196",1,1,1,"大大大","原","2013-06-30"));
//		list.add(new Person("                ",3,1,"1953-05","196",1,1,1,"大大大","原","2013-05-30"));
//		list.add(new Person("                ",3,1,"1953-04","196",1,1,1,"大大大","原","2013-04-30"));
//		list.add(new Person("                ",3,1,"1953-03","196",1,1,1,"大大大","原","2013-03-30"));
//		list.add(new Person("                ",3,1,"1953-02","196",1,1,1,"大大大","原","2013-02-28"));
//		list.add(new Person("                ",3,1,"1953-01","196",1,1,1,"大大大","原","2013-01-30"));


//		list.add(new Person("                ",3,2,"1963-12","197",1,1,1,"大大大","原","2013-12-30"));
//		list.add(new Person("                ",3,2,"1963-11","197",1,1,1,"大大大","原","2013-11-30"));
//		list.add(new Person("                ",3,2,"1963-10","197",1,1,1,"大大大","原","2013-10-30"));
//		list.add(new Person("                ",3,2,"1963-09","197",1,1,1,"大大大","原","2013-09-30"));
//		list.add(new Person("                ",3,2,"1963-08","197",1,1,1,"大大大","原","2013-08-30"));
//		list.add(new Person("                ",3,2,"1963-07","197",1,1,1,"大大大","原","2013-07-30"));
//		list.add(new Person("                ",3,2,"1963-06","197",1,1,1,"大大大","原","2013-06-30"));
//		list.add(new Person("                ",3,2,"1963-05","197",1,1,1,"大大大","原","2013-05-30"));
//		list.add(new Person("                ",3,2,"1963-04","197",1,1,1,"大大大","原","2013-04-30"));
//		list.add(new Person("                ",3,2,"1963-03","197",1,1,1,"大大大","原","2013-03-30"));
//		list.add(new Person("                ",3,2,"1963-02","197",1,1,1,"大大大","原","2013-02-28"));
//		list.add(new Person("                ",3,2,"1963-01","197",1,1,1,"大大大","原","2013-01-30"));


//		list.add(new Person("                ",3,1,"195","197",1,3,1,"大大大","原","2012-12-30"));
//		list.add(new Person("                ",3,2,"196","198",1,3,1,"大大大","原","2012-12-30"));
		
		
///////////////////////////////////////////////////////////////////////////////////////////////////////
		
//		全	3
//		list.add(new Person("                ",3,1,"1952-12","196",1,1,1,"","原","2012-12-30"));
//		list.add(new Person("                ",3,1,"1952-11","196",1,1,1,"","原","2012-11-30"));
		
		
//		list.add(new Person("                ",3,1,"1952-05","196",1,1,1,"","原","2012-05-30"));
//		list.add(new Person("                ",3,1,"1952-04","196",1,1,1,"","原","2012-04-30"));
//		list.add(new Person("                ",3,1,"1952-03","196",1,1,1,"","原","2012-03-30"));
//		list.add(new Person("                ",3,1,"1952-02","196",1,1,1,"","原","2012-02-28"));
//		list.add(new Person("                ",3,1,"1952-01","196",1,1,1,"","原","2012-01-30"));

//		list.add(new Person("                ",3,2,"1962-05","197",1,1,1,"","原","2012-05-30"));
//		list.add(new Person("                ",3,2,"1962-04","197",1,1,1,"","原","2012-04-30"));
//		list.add(new Person("                ",3,2,"1962-03","197",1,1,1,"","原","2012-03-30"));
//		list.add(new Person("                ",3,2,"1962-02","197",1,1,1,"","原","2012-02-28"));
//		list.add(new Person("                ",3,2,"1962-01","197",1,1,1,"","原","2012-01-30"));

//		list.add(new Person("                ",3,1,"195","197",1,3,1,"","原","2010-12-30"));
//		list.add(new Person("                ",3,2,"196","198",1,3,1,"","原","2010-12-30"));
	
///////////////////////////////////////////////////////////////////////////////////////////////////////
		
		
//		list.add(new Person("                ",1,1,"195","197",1,3,1,"大大大","集团","2012-08-30"));
//		list.add(new Person("                ",1,2,"196","198",1,3,1,"大大大","集团","2012-08-30"));
		
		
//		全		1
//		list.add(new Person("                ",1,1,"1952-01","196",1,1,1,"大大大","集团","2012-01-30"));
//		list.add(new Person("                ",1,1,"1952-02","196",1,1,1,"大大大","集团","2012-02-28"));
//		list.add(new Person("                ",1,1,"1952-03","196",1,1,1,"大大大","集团","2012-03-30"));
//		list.add(new Person("                ",1,1,"1952-04","196",1,1,1,"大大大","集团","2012-04-30"));
//		list.add(new Person("                ",1,1,"1952-05","196",1,1,1,"大大大","集团","2012-05-30"));
//		list.add(new Person("                ",1,1,"1952-06","196",1,1,1,"大大大","集团","2012-06-30"));
//		list.add(new Person("                ",1,1,"1952-07","196",1,1,1,"大大大","集团","2012-07-30"));
//		list.add(new Person("                ",1,1,"1952-08","196",1,1,1,"大大大","集团","2012-08-30"));
//		list.add(new Person("                ",1,1,"1952-09","196",1,1,1,"大大大","集团","2012-09-30"));
//		list.add(new Person("                ",1,1,"1952-10","196",1,1,1,"大大大","集团","2012-10-30"));
//		list.add(new Person("                ",1,1,"1952-11","196",1,1,1,"大大大","集团","2012-11-30"));
//		list.add(new Person("                ",1,1,"1952-12","196",1,1,1,"大大大","集团","2012-12-30"));
		
		
//		list.add(new Person("                ",1,2,"1962-01","197",1,1,1,"大大大","集团","2012-01-30"));
//		list.add(new Person("                ",1,2,"1962-02","197",1,1,1,"大大大","集团","2012-02-28"));
//		list.add(new Person("                ",1,2,"1962-03","197",1,1,1,"大大大","集团","2012-03-30"));
//		list.add(new Person("                ",1,2,"1962-04","197",1,1,1,"大大大","集团","2012-04-30"));
//		list.add(new Person("                ",1,2,"1962-05","197",1,1,1,"大大大","集团","2012-05-30"));
//		list.add(new Person("                ",1,2,"1962-06","197",1,1,1,"大大大","集团","2012-06-30"));
//		list.add(new Person("                ",1,2,"1962-07","197",1,1,1,"大大大","集团","2012-07-30"));
//		list.add(new Person("                ",1,2,"1962-08","197",1,1,1,"大大大","集团","2012-08-30"));
//		list.add(new Person("                ",1,2,"1962-09","197",1,1,1,"大大大","集团","2012-09-30"));
//		list.add(new Person("                ",1,2,"1962-10","197",1,1,1,"大大大","集团","2012-10-30"));
//		list.add(new Person("                ",1,2,"1962-11","197",1,1,1,"大大大","集团","2012-11-30"));
//		list.add(new Person("                ",1,2,"1962-12","197",1,1,1,"大大大","集团","2012-12-30"));

		
//		list.add(new Person("                ",1,1,"195","197",1,3,1,"","原","2013-06-30"));
//		list.add(new Person("                ",1,2,"196","198",1,3,1,"","原","2013-06-30"));
		
//		list.add(new Person("                ",1,1,"1953-06","197",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,1,"1953-05","197",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,1,"1953-04","197",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,1,"1953-03","197",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,1,"1953-02","197",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,1,"1953-01","197",1,1,1,"大大大","集团"));


//		list.add(new Person("                ",1,2,"1963-07","198",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,2,"1963-06","198",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,2,"1963-05","198",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,2,"1963-04","198",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,2,"1963-03","198",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,2,"1963-02","198",1,1,1,"大大大","集团"));
//		list.add(new Person("                ",1,2,"1963-01","198",1,1,1,"大大大","集团"));
		
		
//555		
		
//		,"2013-01-30"
//		remark = "1";
//		remark = "2";
		
		
		
		Iterator<Person> it = list.iterator();
		
		
		CreateGroupWord gWord = new CreateGroupWord(); 
		
		Db_Util db = Db_Util.getInstance();
		
		WordUtil wUtil = WordUtil.getInstance();
		wUtil.wordOpen();
		
		boolean isHaveWorng = false;
		
		while(it.hasNext() && isHaveWorng == false) {
			Person person = it.next();
			
			if(remark != ""){
				person.setRemark(remark);
			}
			
			if (Util.check(person)) {
				db.addOnePerson(person);
				gWord.createDocContext(wUtil, person,it.hasNext());
			} else {
				isHaveWorng = true;
			}

		}
		
		if (isHaveWorng == false) {
			db.commit();
		}
		
		wUtil.wordClose();
		db.shutdown();
		
		//TODO 写Word
		
	
//		Calendar bron = Calendar.getInstance();
//		Calendar join = Calendar.getInstance();
//		Calendar shen = Calendar.getInstance();
//
//		SimpleDateFormat df = new SimpleDateFormat("yyyy-MM");
//		SimpleDateFormat df1 = new SimpleDateFormat("yyyy-MM-dd");
//
//		Person person = new Person();
//
//		
//		
//		person.setId("0912210158860024             ");//编号
//		person.setName("李文庆");//姓名
//
//		person.setComp("众环集团");//公司
//		
//		person.setKesh(1);//科室 1-业务一科，2-业务二科，3-业务三科，4-直属
//
//
//		person.setSex(1);//性别 1-男，2-女
//		
//		
//		bron.setTime(df.parse("1949-12"));//出生年月
//		join.setTime(df.parse("1969-10"));//参加工作时间
//		
//		
//		person.setType(1);//身份 1-工人，2-干部
//		
//		person.setShenfen(1);//类型 1-正常，2-病退，3-特殊工种，4-退职， 5-破产
//
//		
////		shen.setTime(df1.parse("2009-11-30"));//受理时间
//		
//		if(person.getShenfen() == 2) {
//		
////			person.setBingNum(111);//病退号
//			
//		}
//
//		
//		person.setBorn(bron);
//		person.setJoin(join);
//		
//		person.setShen(shen);
//		
//		
//		
//		Db_Util db = Db_Util.getInstance();
//		db.insertStatement(person);
//		db.shutdown();
//
//		
//		CreateWord word = new CreateWord();
//		String file = "d:/demo1.doc";
//		
//		if (Util.check(person)) {
//			try {
//				word.createDocContext(file, person);
//			} catch (DocumentException e) {
//				e.printStackTrace();
//			} catch (IOException e) {
//				e.printStackTrace();
//			}
//		
		
	}
}